<!DOCTYPE html SYSTEM "about:legacy-compat">
<html lang="en-US" data-preset="contrast" data-primary-color="#307FFF"><head><meta http-equiv="Content-Type" content="text/html; charset=UTF-8"><meta charset="UTF-8"><meta name="robots" content="noindex"><meta name="built-on" content="2024-05-16T15:48:31.9757361"><title>Cloud computing - různ&eacute; vitalizace typy (SaaS, PaaS, IaaS), v&yacute;hody a nev&yacute;hody | Maturita</title><script type="application/json" id="virtual-toc-data">[{"id":"cloud-computing","level":0,"title":"Cloud computing","anchor":"#cloud-computing"}]</script><script type="application/json" id="topic-shortcuts"></script><link href="https://resources.jetbrains.com/writerside/apidoc/6.10.0-b259/app.css" rel="stylesheet"><meta name="msapplication-TileColor" content="#000000"><link rel="apple-touch-icon" sizes="180x180" href="https://jetbrains.com/apple-touch-icon.png"><link rel="icon" type="image/png" sizes="32x32" href="https://jetbrains.com/favicon-32x32.png"><link rel="icon" type="image/png" sizes="16x16" href="https://jetbrains.com/favicon-16x16.png"><meta name="msapplication-TileImage" content="https://resources.jetbrains.com/storage/ui/favicons/mstile-144x144.png"><meta name="msapplication-square70x70logo" content="https://resources.jetbrains.com/storage/ui/favicons/mstile-70x70.png"><meta name="msapplication-square150x150logo" content="https://resources.jetbrains.com/storage/ui/favicons/mstile-150x150.png"><meta name="msapplication-wide310x150logo" content="https://resources.jetbrains.com/storage/ui/favicons/mstile-310x150.png"><meta name="msapplication-square310x310logo" content="https://resources.jetbrains.com/storage/ui/favicons/mstile-310x310.png"><meta name="image" content=""><!-- Open Graph --><meta property="og:title" content="Cloud computing - různ&eacute; vitalizace typy (SaaS, PaaS, IaaS), v&yacute;hody a nev&yacute;hody | Maturita"><meta property="og:description" content=""><meta property="og:image" content=""><meta property="og:site_name" content="Maturita Help"><meta property="og:type" content="website"><meta property="og:locale" content="en_US"><meta property="og:url" content="writerside-documentation//20.24/cloud-computing-různé-vitalizace-typy-saas-paas-iaas-výhody-a-nevýhody.html"><!-- End Open Graph --><!-- Twitter Card --><meta name="twitter:card" content="summary_large_image"><meta name="twitter:site" content=""><meta name="twitter:title" content="Cloud computing - různ&eacute; vitalizace typy (SaaS, PaaS, IaaS), v&yacute;hody a nev&yacute;hody | Maturita"><meta name="twitter:description" content=""><meta name="twitter:creator" content=""><meta name="twitter:image:src" content=""><!-- End Twitter Card --><!-- Schema.org WebPage --><script type="application/ld+json">{
    "@context": "http://schema.org",
    "@type": "WebPage",
    "@id": "writerside-documentation//20.24/cloud-computing-různé-vitalizace-typy-saas-paas-iaas-výhody-a-nevýhody.html#webpage",
    "url": "writerside-documentation//20.24/cloud-computing-různé-vitalizace-typy-saas-paas-iaas-výhody-a-nevýhody.html",
    "name": "Cloud computing - různ&eacute; vitalizace typy (SaaS, PaaS, IaaS), v&yacute;hody a nev&yacute;hody | Maturita",
    "description": "",
    "image": "",
    "inLanguage":"en-US"
}</script><!-- End Schema.org --><!-- Schema.org WebSite --><script type="application/ld+json">{
    "@type": "WebSite",
    "@id": "writerside-documentation/#website",
    "url": "writerside-documentation/",
    "name": "Maturita Help"
}</script><!-- End Schema.org --></head><body data-id="Cloud-computing-různé-vitalizace-typy-SaaS-PaaS-IaaS-výhody-a-nevýhody" data-main-title="Cloud computing - různé vitalizace typy (SaaS, PaaS, IaaS), výhody a nevýhody" data-article-props="{&quot;seeAlsoStyle&quot;:&quot;links&quot;}" data-template="article" data-breadcrumbs="Questions.md|PSS"><div class="wrapper"><main class="panel _main"><header class="panel__header"><div class="container"><h3>Maturita 20.24 Help</h3><div class="panel-trigger"></div></div></header><section class="panel__content"><div class="container"><article class="article" data-shortcut-switcher="inactive"><h1 data-toc="Cloud-computing-různé-vitalizace-typy-SaaS-PaaS-IaaS-výhody-a-nevýhody" id="Cloud-computing-různé-vitalizace-typy-SaaS-PaaS-IaaS-výhody-a-nevýhody.md">Cloud computing - různé vitalizace typy (SaaS, PaaS, IaaS), výhody a nevýhody</h1><section class="chapter"><h2 id="cloud-computing" data-toc="cloud-computing">Cloud computing</h2><p id="-gxbre8_2">je na internetu založen&yacute; model v&yacute;voje a použ&iacute;v&aacute;n&iacute; poč&iacute;tačov&yacute;ch technologi&iacute;. Lze ho tak&eacute; charakterizovat jako poskytov&aacute;n&iacute; služeb či programů servery dostupn&yacute;mi z internetu s t&iacute;m, že uživatel&eacute; k nim mohou přistupovat vzd&aacute;leně, kupř. pomoc&iacute; webov&eacute;ho prohl&iacute;žeče nebo klienta elektronick&eacute; po&scaron;ty. Za předpokladu, že služba je placen&aacute;, uživatel&eacute; neplat&iacute; za vlastn&iacute; software, ale za jeho užit&iacute; na měs&iacute;čn&iacute; či ročn&iacute; b&aacute;zi, nebo zaplat&iacute; jednor&aacute;zov&yacute; poplatek. Principem u služeb a produktů v cloud computingu je to, že uživateli propůjčuj&iacute; v&yacute;početn&iacute; v&yacute;kon serverů. V mnoha př&iacute;padech se tak děje formou specializovan&yacute;ch aplikac&iacute;, jejichž nab&iacute;dka se pohybuje od kancel&aacute;řsk&yacute;ch aplikac&iacute; přes syst&eacute;my pro distribuovan&eacute; v&yacute;počty až po operačn&iacute; syst&eacute;my provozovan&eacute; v prohl&iacute;žeč&iacute;ch</p><section class="chapter"><h3 id="technologie-cloud-computingu-se-vyznacuje-nasledujicimi-atributy" data-toc="technologie-cloud-computingu-se-vyznacuje-nasledujicimi-atributy">Technologie cloud computingu se vyznacuje nasledujicimi atributy:</h3><ul class="list _bullet" id="-gxbre8_3"><li class="list__item" id="-gxbre8_4"><p>Multitenancy: tento pojem lze volne prelozit jako &quot;vice najmu&quot;. Jedna se o to, ze pocitacove zdroje jsou sdilene mezi vsemi uzivateli.</p></li><li class="list__item" id="-gxbre8_5"><p>Obrovska skalovatelnost a elasticita: umozni uzivatelum dle potreby operativne zmeni vypocetni zdroje.</p></li><li class="list__item" id="-gxbre8_6"><p>Pay as you go: cenovy tarif zalozeny na principu &quot;Kolik toho uzivatel spotrebuje, tolik zaplati&quot;</p></li><li class="list__item" id="-gxbre8_7"><p>Aktualnost (up-to-date): poskytovatel garantuje ze vsechen software je vzdy aktualizovany; uzivatel nemusi do tohoto procesu nijak zasahovat</p></li><li class="list__item" id="-gxbre8_8"><p>Pristup pres internet: uzivatele se mohou ke svemu softwaru pripojit z jakekoli casti sveta.</p></li></ul></section><section class="chapter"><h3 id="v-zasade-existuje-dvoji-deleni-cloud-computingu" data-toc="v-zasade-existuje-dvoji-deleni-cloud-computingu">V zasade existuje dvoji deleni cloud computingu:</h3><ul class="list _bullet" id="-gxbre8_9"><li class="list__item" id="-gxbre8_10"><p>kriterium toho, jak jsou sluzby cloudu poskytovany</p></li><li class="list__item" id="-gxbre8_11"><p>charakter sluzby kterou cloud poskytuje.</p></li></ul></section><section class="chapter"><h3 id="typy-cloudu" data-toc="typy-cloudu">Typy cloudu</h3><section class="chapter"><h4 id="verejny-cloud" data-toc="verejny-cloud">Verejny cloud</h4><p id="-gxbre8_12">Veřejn&yacute; cloud je nejčastěj&scaron;&iacute;m servisn&iacute;m modelem cloudov&yacute;ch služeb a je z&aacute;roveň modelem, kter&yacute; umožňuje nejjednodu&scaron;&scaron;&iacute; &scaron;k&aacute;lov&aacute;n&iacute; v&yacute;početn&iacute;ho v&yacute;konu a dal&scaron;&iacute;ch zdrojů pro potřebu z&aacute;kazn&iacute;ka. Jedn&aacute; se o službu dodavatele cloudov&yacute;ch služeb, kdy tento dodavatel vybuduje jedno nebo v&iacute;ce datov&yacute;ch center, kter&aacute; spadaj&iacute; pod jeho plnou spr&aacute;vu a v nich provozuje cloudov&eacute; služby (v různ&yacute;ch modelech &ndash; od infrastruktury až po hotov&eacute; aplikace) př&iacute;stupn&eacute; z&aacute;kazn&iacute;kům přes internet. Dostupnost služeb z&aacute;kazn&iacute;kům je pak určena pomoc&iacute; SLA. Tyto služby jsou z&aacute;kazn&iacute;kům dod&aacute;v&aacute;ny zadarmo či za poplatek nejčastěji spjat&yacute; s objemem využit&yacute;ch služeb &ndash; PAYG. Jelikož v jednom prostřed&iacute; nad jedn&iacute;m hardwarem mohou běžet služby a prostředky v&iacute;ce z&aacute;kazn&iacute;ků, bav&iacute;me se o takzvan&eacute; multitenant architektuře. Jeden tenant si můžeme představit jako prostřed&iacute; jednoho z&aacute;kazn&iacute;ka &ndash; např&iacute;klad v&scaron;ichni uživatel&eacute; ře&scaron;en&iacute; cloudov&eacute;ho &uacute;loži&scaron;tě dat a jejich data a nastaven&iacute; v r&aacute;mci jedn&eacute; firmy. Data těchto uživatelů mohou b&yacute;t pot&eacute; uložena na stejn&eacute;m hardwaru jako data jin&yacute;ch z&aacute;kazn&iacute;ků, nicm&eacute;ně jednotliv&iacute; z&aacute;kazn&iacute;ci si do dat sv&yacute;ch uživatelů navz&aacute;jem nevid&iacute; &ndash; pr&aacute;vě d&iacute;ky multitenant architektuře. Ta přin&aacute;&scaron;&iacute; v&yacute;hody sn&iacute;žen&iacute; n&aacute;kladů na službu, ale tak&eacute; jednoduchou &scaron;k&aacute;lovatelnost. Ekonomick&eacute; principy cloudu vych&aacute;zej&iacute; z předpokladu, že ve veřejn&eacute;m cloudu může z&aacute;kazn&iacute;k z&iacute;skat nejlevněj&scaron;&iacute; v&yacute;kon.[8] Toto je zapř&iacute;činěno t&iacute;m, že velkoodběratel hardwaru a služeb dok&aacute;že stlačit cenu n&iacute;že než každ&yacute; jednotliv&yacute; uživatel zvl&aacute;&scaron;ť. D&iacute;ky tomu může poskytovat služby za niž&scaron;&iacute; cenu, než kter&eacute; by jednotliv&iacute; z&aacute;kazn&iacute;ci mohli dos&aacute;hnout sami.</p></section><section class="chapter"><h4 id="privatni-cloud" data-toc="privatni-cloud">Privatni cloud</h4><p id="-gxbre8_13">Oproti veřejn&eacute;mu cloudu se priv&aacute;tn&iacute; cloud li&scaron;&iacute; t&iacute;m, že jsou ve&scaron;ker&eacute; prostředky tohoto nasazen&iacute; dedikov&aacute;ny a použ&iacute;v&aacute;ny pouze jedn&iacute;m uživatelem/z&aacute;kazn&iacute;kem &ndash; nad prostředky tedy běž&iacute; jedin&yacute; tenant. Hardware i software běž&iacute; na dedikovan&eacute; priv&aacute;tn&iacute; s&iacute;ti a z&aacute;roveň na hardwaru nikdy neběž&iacute; služby pro jin&eacute;ho z&aacute;kazn&iacute;ka. Služby priv&aacute;tn&iacute;ho cloudu poskytuje buď př&iacute;mo poskytoval cloudov&yacute;ch služeb ze sv&eacute;ho hardwaru (za dodržen&iacute; podm&iacute;nek v&yacute;&scaron;e o pln&eacute;m dedikov&aacute;n&iacute; tohoto hardwaru jedin&eacute;mu z&aacute;kazn&iacute;kovi), nebo př&iacute;mo na serverech/v datacentru z&aacute;kazn&iacute;ka. Důvodem nasazen&iacute; priv&aacute;tn&iacute;ho cloudu je často důraz na bezpečnost nebo regulatorn&iacute; omezen&iacute; u z&aacute;kazn&iacute;ka &ndash; setk&aacute;v&aacute;me se tak s n&iacute;m předev&scaron;&iacute;m u finančn&iacute;ch a st&aacute;tn&iacute;ch instituc&iacute;. Mezi v&yacute;hody, kter&eacute; z&iacute;sk&aacute;v&aacute; uživatel priv&aacute;tn&iacute;ho cloudu, patř&iacute; pr&aacute;vě bezpečnost a kontrola nad daty a z&aacute;roveň jednoduch&aacute; &scaron;k&aacute;lovatelnost a ř&iacute;zen&iacute; prostředků. Nev&yacute;hodou oproti veřejn&eacute;mu cloudu je pak ztr&aacute;ta flexibility zd&aacute;nlivě neomezen&eacute;ho množstv&iacute; v&yacute;početn&iacute;ho v&yacute;konu a př&iacute;padn&eacute; dal&scaron;&iacute; n&aacute;klady na agendu spojenou se spr&aacute;vou vlastn&iacute;ho hardwaru, rovněž je priv&aacute;tn&iacute; cloud často spojen s vy&scaron;&scaron;&iacute;mi poč&aacute;tečn&iacute;mi n&aacute;klady.</p></section><section class="chapter"><h4 id="hybridni-cloud" data-toc="hybridni-cloud">Hybridni cloud</h4><p id="-gxbre8_14">Hybridn&iacute; cloud je ře&scaron;en&iacute;, kter&eacute; spojuje v&yacute;hody veřejn&eacute;ho a priv&aacute;tn&iacute;ho cloudu, př&iacute;padně spojen&iacute; veřejn&eacute;ho cloudu s jinou m&iacute;stn&iacute; infrastrukturou. K takov&eacute;muto nasazen&iacute; obvykle přistupujeme, pokud chceme zachovat kontrolu nad kritick&yacute;mi nebo citliv&yacute;mi daty a prac&iacute; nad nimi &ndash; takov&aacute;to data zůst&aacute;vaj&iacute; na priv&aacute;tn&iacute;m cloudu nebo m&iacute;stn&iacute;ch datab&aacute;z&iacute;ch a veřejn&yacute; cloud slouž&iacute; k operac&iacute;m s men&scaron;&iacute;m důrazem na bezpečnost &ndash; nebo např&iacute;klad pro běh legacy aplikac&iacute;; při přechodu na cloud z m&iacute;stn&iacute; infrastruktury (tzv. on-premise) &ndash; jedn&aacute; se o stav postupn&eacute; migrace do veřejn&eacute;ho cloudu; nebo veřejn&yacute; cloud využ&iacute;v&aacute;me jako zdroj dodatečn&eacute; v&yacute;početn&iacute; s&iacute;ly &ndash; běžn&eacute; operace běž&iacute; na m&iacute;stn&iacute; infrastruktuře a při nadstandardn&iacute;m vyt&iacute;žen&iacute; jsou dynamicky vytvořeny dal&scaron;&iacute; v&yacute;početn&iacute; zdroje ve veřejn&eacute;m cloudu. V hybridn&iacute;m nasazen&iacute; se tedy sch&aacute;z&iacute; v&yacute;hoda siln&eacute; kontroly a bezpečnosti, ale i flexibility.</p></section><section class="chapter"><h4 id="multicloud" data-toc="multicloud">Multicloud</h4><p id="-gxbre8_15">Multicloudov&eacute; ře&scaron;en&iacute; je ře&scaron;en&iacute;, kter&eacute; využ&iacute;v&aacute; služeb v&iacute;ce dodavatelů veřejn&eacute;ho cloudu (př&iacute;padně může b&yacute;t kombinov&aacute;no s hybridn&iacute;m sc&eacute;n&aacute;řem). Toto uživatelům a z&aacute;kazn&iacute;kům přin&aacute;&scaron;&iacute; v&yacute;hody jako minimalizace rizik, využ&iacute;v&aacute;n&iacute; možnost&iacute; v&iacute;ce cloudov&yacute;ch vendorů, sn&iacute;žen&iacute; z&aacute;vislosti na konkr&eacute;tn&iacute;m dodavateli nebo vytvořen&iacute; tlaku na niž&scaron;&iacute; cenu (d&iacute;ky kompetitivn&iacute;mu prostřed&iacute;)[11]. Mezi nev&yacute;hody naopak patř&iacute; potřeba udržov&aacute;n&iacute; &scaron;ir&scaron;&iacute;ch znalost&iacute; cloudu jednotliv&yacute;ch dodavatelů, bezpečn&eacute; a jednotn&eacute; ř&iacute;zen&iacute; př&iacute;stupů a integrace ře&scaron;en&iacute; (ačkoliv cloudov&iacute; dodavatel&eacute; již pracuj&iacute; na jednoduch&eacute;m prov&aacute;z&aacute;n&iacute; a umožněn&iacute; multicloudov&eacute; strategie).</p></section><section class="chapter"><h4 id="komunitni-cloud" data-toc="komunitni-cloud">Komunitni cloud</h4><p id="-gxbre8_16">Jedn&aacute; se o model, kdy je infrastruktura cloudu sd&iacute;lena mezi několika organizacemi, tedy skupinou lid&iacute;, kteř&iacute; ji využ&iacute;vaj&iacute;. Tyto organizace může spojovat bezpečnostn&iacute; politika, stejn&yacute; obor z&aacute;jmu apod.&uml;</p></section></section><section class="chapter"><h3 id="distribucni-model" data-toc="distribucni-model">Distribucni model</h3><p id="-gxbre8_17">Distribučn&iacute; model vypov&iacute;d&aacute; o tom, co je v r&aacute;mci služby nab&iacute;zeno &ndash; zda jde o software, hardware či jejich kombinaci.</p><ul class="list _bullet" id="-gxbre8_18"><li class="list__item" id="-gxbre8_19"><p>IaaS: infrastruktura jako služba (Infrastructure as a Service) &ndash; poskytovatel služeb se zavazuje poskytnout infrastrukturu. Typicky se jedn&aacute; o virtualizaci. Hlavn&iacute; v&yacute;hodou tohoto př&iacute;stupu je, že o ve&scaron;ker&eacute; probl&eacute;my s hardwarem se star&aacute; poskytovatel. Na druhou stranu, vzhledem k tomu, že hardware se bere jako něco, co vlastn&iacute;me, na co můžeme s&aacute;hnout a jsme za to zodpovědn&iacute;, je někdy nemožn&eacute; toto akceptovat. IaaS je vhodn&eacute; pro ty, kteř&iacute; vlastn&iacute; software (či jejich licence) a nechtěj&iacute; se starat o hardware. Př&iacute;klady IaaS jsou Amazon WS, Rackspace nebo Windows Azure. Zkratka IaaS může znamenat t&eacute;ž integrace jako služba(Integration as a Service).</p></li><li class="list__item" id="-gxbre8_20"><p>PaaS: platforma jako služba (Platform as a Service) &ndash; poskytovatel garantuje kompletn&iacute; prostředky pro podporu cel&eacute;ho životn&iacute;ho cyklu tvorby a poskytov&aacute;n&iacute; webov&yacute;ch aplikac&iacute; a služeb; to plně na internetu, bez možnosti stažen&iacute; softwaru. Koncepce zahrnuje různ&eacute; prostředky pro v&yacute;voj aplikac&iacute;, jako jsou IDE nebo API, ale rovněž např. pro &uacute;držbu. Nev&yacute;hodou tohoto př&iacute;stupu je propriet&aacute;rn&iacute; uzamčen&iacute;, kdy různ&iacute; poskytovatel&eacute; mohou použ&iacute;vat např. různ&eacute; programovac&iacute; jazyky. Př&iacute;klady poskytovatelů PaaS jsou Google App Engine nebo Force.com(Salesforce.com).</p></li><li class="list__item" id="-gxbre8_21"><p>SaaS: software jako služba (Software as a Service) &ndash; aplikace je licencov&aacute;na jako služba pronaj&iacute;man&aacute; uživateli. Uživatel&eacute; si tedy kupuj&iacute; př&iacute;stup k aplikaci, ne aplikaci samotnou. SaaS je ide&aacute;ln&iacute; pro ty, kteř&iacute; potřebuj&iacute; jen běžn&yacute; aplikačn&iacute; software a požaduj&iacute; př&iacute;stup odkudkoliv a kdykoliv. Př&iacute;kladem může b&yacute;t sada aplikac&iacute; Google Apps nebo v logistice zn&aacute;m&yacute; syst&eacute;m Cargopass.</p></li></ul></section><section class="chapter"><h3 id="vyhody-vyuzivani-cloudu" data-toc="vyhody-vyuzivani-cloudu">Vyhody vyuzivani cloudu</h3><ul class="list _bullet" id="-gxbre8_22"><li class="list__item" id="-gxbre8_23"><p>Absence nutnosti nakupu nakladneho HW a znalosti principu funkcnosti SW a HW</p></li><li class="list__item" id="-gxbre8_24"><p>Efektivni rizeni a prace diky dostupnosti dat odkudkoli - rust produktivity prace ve firmach.</p></li><li class="list__item" id="-gxbre8_25"><p>Jednoduchost uzivatelskeho rozhrani</p></li><li class="list__item" id="-gxbre8_26"><p>Principalne vyssi zabezpeceni dat, oproti vetsine On-Premise reseni</p></li><li class="list__item" id="-gxbre8_27"><p>Moznost okamziteho zvyseni vykonu datoveho centra</p></li><li class="list__item" id="-gxbre8_28"><p>Rychle prizbusobeni IT zazemi, rustu a potrebam uzivatele</p></li><li class="list__item" id="-gxbre8_29"><p>Snizeni ceny na porizovani IT infrastruktury.</p></li><li class="list__item" id="-gxbre8_30"><p>Minimalizace provoznich nakladu.</p></li></ul></section><section class="chapter"><h3 id="nevyhody-vyuzivani-cloudu" data-toc="nevyhody-vyuzivani-cloudu">Nevyhody vyuzivani cloudu</h3><ul class="list _bullet" id="-gxbre8_31"><li class="list__item" id="-gxbre8_32"><p>zavislost na internetovem pripojeni.</p></li><li class="list__item" id="-gxbre8_33"><p>Z&aacute;vislost na poskytovateli &ndash; společnosti využ&iacute;vaj&iacute;c&iacute; cloud ztr&aacute;c&iacute; možnost rozhodovat, kterou verzi použ&iacute;vat (plat&iacute; pro v&iacute;ceverzovan&yacute; SW). Č&iacute;m vět&scaron;&iacute; společnost&iacute; je poskytovatel, t&iacute;m hůře se s n&iacute;m komunikuje a vyjedn&aacute;vaj&iacute; podm&iacute;nky.</p></li><li class="list__item" id="-gxbre8_34"><p>Obavy z cloud computingu &ndash; cloud je sice již řadu let standardn&iacute; ře&scaron;en&iacute;, ale st&aacute;le přetrv&aacute;v&aacute; nerelevantn&iacute; obava z uložen&iacute; dat mimo sv&eacute; prostřed&iacute;, přestože běžně použ&iacute;v&aacute;me soci&aacute;ln&iacute; s&iacute;tě či přistupujeme na bankovn&iacute; &uacute;čet online. Je tedy potřeba se zaj&iacute;mat o zabezpečen&iacute; dat u dan&eacute;ho dodavatele a v&scaron;eobecn&eacute; podm&iacute;nky poskytov&aacute;n&iacute; služby samotn&eacute;.</p></li><li class="list__item" id="-gxbre8_35"><p>Odli&scaron;n&yacute; pr&aacute;vn&iacute; ř&aacute;d poskytovatele a klienta &ndash; poskytovatel cloud computingu může b&yacute;t podř&iacute;zen jin&eacute; jurisdikci než jeho klient. Např. společnosti s&iacute;dl&iacute;c&iacute; v USA nebo poskytuj&iacute;c&iacute; službu z USA jsou povinny postoupit data klienta vl&aacute;dě v souladu s PATRIOT Actem, což může kolidovat kupř. s povinnost&iacute; ochrany osobn&iacute;ch &uacute;dajů uloženou poskytovateli z&aacute;konem. Zaj&iacute;mejte se, kde jsou va&scaron;e data uložena, mimo EU je to již risk.</p></li></ul></section></section><div class="last-modified">Last modified: 16 May 2024</div><div data-feedback-placeholder="true"></div><div class="navigation-links _bottom"><a href="teorie-os-fungování-os-struktura-os-správa-procesů-pseudoparalelismus.html" class="navigation-links__prev">Teorie OS - fungov&aacute;n&iacute; OS, struktura OS, spr&aacute;va procesů, pseudoparalelismus</a><a href="os-linux-struktura-os-shell-koncepce-typy-příkazy-správa-programového-vybavení-start-systému-služby-naplánované-procesy-souborový-sytém-účel-základních-adresářů.html" class="navigation-links__next">OS Linux - Struktura OS, Shell: koncepce, typy, př&iacute;kazy. Spr&aacute;va programov&eacute;ho vybaven&iacute;. Start syst&eacute;mu. Služby, napl&aacute;novan&eacute; procesy. Souborov&yacute; syt&eacute;m, &Uacute;čel z&aacute;kladn&iacute;ch adres&aacute;řů.</a></div></article><div id="disqus_thread"></div></div></section></main></div><script src="https://resources.jetbrains.com/writerside/apidoc/6.10.0-b259/app.js"></script></body></html>