<!DOCTYPE html SYSTEM "about:legacy-compat">
<html lang="en-US" data-preset="contrast" data-primary-color="#307FFF"><head><meta http-equiv="Content-Type" content="text/html; charset=UTF-8"><meta charset="UTF-8"><meta name="robots" content="noindex"><meta name="built-on" content="2024-05-13T22:10:19.595053"><title>DNS, funkce, hierarchie DNS (od souboru po glob&aacute;ln&iacute; DNS servery), konfigurace | Maturita</title><script type="application/json" id="virtual-toc-data">[{"id":"dns-tpc-53-udp-53-rfc1035","level":0,"title":"DNS (TPC/53, UDP/53) RFC1035","anchor":"#dns-tpc-53-udp-53-rfc1035"},{"id":"dns-server","level":0,"title":"DNS Server","anchor":"#dns-server"}]</script><script type="application/json" id="topic-shortcuts"></script><link href="https://resources.jetbrains.com/writerside/apidoc/6.10.0-b259/app.css" rel="stylesheet"><meta name="msapplication-TileColor" content="#000000"><link rel="apple-touch-icon" sizes="180x180" href="https://jetbrains.com/apple-touch-icon.png"><link rel="icon" type="image/png" sizes="32x32" href="https://jetbrains.com/favicon-32x32.png"><link rel="icon" type="image/png" sizes="16x16" href="https://jetbrains.com/favicon-16x16.png"><meta name="msapplication-TileImage" content="https://resources.jetbrains.com/storage/ui/favicons/mstile-144x144.png"><meta name="msapplication-square70x70logo" content="https://resources.jetbrains.com/storage/ui/favicons/mstile-70x70.png"><meta name="msapplication-square150x150logo" content="https://resources.jetbrains.com/storage/ui/favicons/mstile-150x150.png"><meta name="msapplication-wide310x150logo" content="https://resources.jetbrains.com/storage/ui/favicons/mstile-310x150.png"><meta name="msapplication-square310x310logo" content="https://resources.jetbrains.com/storage/ui/favicons/mstile-310x310.png"><meta name="image" content=""><!-- Open Graph --><meta property="og:title" content="DNS, funkce, hierarchie DNS (od souboru po glob&aacute;ln&iacute; DNS servery), konfigurace | Maturita"><meta property="og:description" content=""><meta property="og:image" content=""><meta property="og:site_name" content="Maturita Help"><meta property="og:type" content="website"><meta property="og:locale" content="en_US"><meta property="og:url" content="writerside-documentation//20.24/dns-funkce-hierarchie-dns-od-souboru-po-globální-dns-servery-konfigurace.html"><!-- End Open Graph --><!-- Twitter Card --><meta name="twitter:card" content="summary_large_image"><meta name="twitter:site" content=""><meta name="twitter:title" content="DNS, funkce, hierarchie DNS (od souboru po glob&aacute;ln&iacute; DNS servery), konfigurace | Maturita"><meta name="twitter:description" content=""><meta name="twitter:creator" content=""><meta name="twitter:image:src" content=""><!-- End Twitter Card --><!-- Schema.org WebPage --><script type="application/ld+json">{
    "@context": "http://schema.org",
    "@type": "WebPage",
    "@id": "writerside-documentation//20.24/dns-funkce-hierarchie-dns-od-souboru-po-globální-dns-servery-konfigurace.html#webpage",
    "url": "writerside-documentation//20.24/dns-funkce-hierarchie-dns-od-souboru-po-globální-dns-servery-konfigurace.html",
    "name": "DNS, funkce, hierarchie DNS (od souboru po glob&aacute;ln&iacute; DNS servery), konfigurace | Maturita",
    "description": "",
    "image": "",
    "inLanguage":"en-US"
}</script><!-- End Schema.org --><!-- Schema.org WebSite --><script type="application/ld+json">{
    "@type": "WebSite",
    "@id": "writerside-documentation/#website",
    "url": "writerside-documentation/",
    "name": "Maturita Help"
}</script><!-- End Schema.org --></head><body data-id="DNS-funkce-hierarchie-DNS-od-souboru-po-globální-DNS-servery-konfigurace" data-main-title="DNS, funkce, hierarchie DNS (od souboru po globální DNS servery), konfigurace" data-article-props="{&quot;seeAlsoStyle&quot;:&quot;links&quot;}" data-template="article" data-breadcrumbs="Questions.md|PSS"><div class="wrapper"><main class="panel _main"><header class="panel__header"><div class="container"><h3>Maturita 20.24 Help</h3><div class="panel-trigger"></div></div></header><section class="panel__content"><div class="container"><article class="article" data-shortcut-switcher="inactive"><h1 data-toc="DNS-funkce-hierarchie-DNS-od-souboru-po-globální-DNS-servery-konfigurace" id="DNS-funkce-hierarchie-DNS-od-souboru-po-globální-DNS-servery-konfigurace.md">DNS, funkce, hierarchie DNS (od souboru po globální DNS servery), konfigurace</h1><section class="chapter"><h2 id="dns-tpc-53-udp-53-rfc1035" data-toc="dns-tpc-53-udp-53-rfc1035">DNS (TPC/53, UDP/53) RFC1035</h2><p id="i7tdl9j_2">Domain name system je hierarrchyck&yacute;, decentralizovan&yacute; syst&eacute;m dom&eacute;nov&yacute;ch jmen, kter&yacute; je realizov&aacute;n servery DNS a protokolem stejn&eacute;ho jm&eacute;na, kter&yacute;m si vyměnuj&iacute; informace. Jeho hlavn&iacute;m &uacute;kolem a přčinou vzniku jsou vz&aacute;jmen&eacute; převody dom&eacute;nov&yacute;ch jmen a IP adres uzlů s&iacute;tě. Později ale přibral dal&scaron;&iacute; funkce (např. pro elektronickou po&scaron;tu či IP telefonii) a slouž&iacute; dnes de facto jako distribuovan&aacute; datab&aacute;ze s&iacute;ťov&yacute;ch informac&iacute;.</p><p id="i7tdl9j_3">Jm&eacute;na dom&eacute;n umožňuje lep&scaron;&iacute; orientaci lide, adresy pro stroje jsou v&scaron;ak vyj&aacute;dřeny pomoc&iacute; 32bitov&yacute;ch(IPv4) A nebo 128 bitov&yacute;ch (IPv6) AAAA z&aacute;znamů. Syst&eacute;m DNS umožňuje efetkivně udržovat decentrilozovan&eacute; datab&aacute;ze dom&eacute;nov&yacute;ch jmen a jejich překlad na IP adresy. Stejně tak zaji&scaron;tťuje zpětn&yacute; překla IP adresy na dom&eacute;nov&eacute; jm&eacute;no = PTR z&aacute;znam.</p></section><section class="chapter"><h2 id="dns-server" data-toc="dns-server">DNS Server</h2><ul class="list _bullet" id="i7tdl9j_4"><li class="list__item" id="i7tdl9j_5"><p>Autorirativn&iacute; server: je ten, na němž jsou trvale uloženy z&aacute;znamy k dan&eacute; dom&eacute;ně/z&oacute;ně. Autorirativn&iacute;ch serverů je obcykle v&iacute;ce (minim&aacute;lně dva - prim&aacute;rn&iacute; a sekund&aacute;rn&iacute;, ale běžně i v&iacute;ce) a až na velmi specialni pripady se na vsech udrzuji totozne zaznamy, tzn. kazdou zmenu v zaznamech je potreba propagovat na vsechny autoritrativni servery. Autorirativni DNS server y jsou obvykle provozovany registratorem domeny nebo poskytovatelem webhostingu.</p></li><li class="list__item" id="i7tdl9j_6"><p>Rekurzivni (caching only) server je server, na ktery se se svymi dotazy obraceji klientska zarizeni (pocitac, mobil etc.). Server pro ne prislusny zaznam ziska rekurzivnimi dotazy u autoritativnich DNS serveru a po stanovenou dobu (definovanou pomoci parametru TTL(Time to live)) je ma ulozeny v cache, aby mohl odpovidat klientu rychleji a setril zatizeni serveru autoritativnich. Na tomto serveru nejsou zadne zony ulozeny trvale. Rekurzivni DNS server se take stara o validaci DNSSEC, pokud tuto technologii podporuje. Rekurzivnich serveru muze byt na klientu definovano vice na ruznych IP adresach, ale v praxi se spise yajistuje vzsoka dostupnost serveru na prvni definovane IP adrese. Informaci o DNS serverech na dane siti klient zjistuje necjasteji pres protokol DHCP, na IPv6 pres NDP</p></li><li class="list__item" id="i7tdl9j_7"><p>Root server korenove servery predstavuji zasadni cast technicke infrastruktury internetu, na ktere zavisi spolehlisvost, spravnost a bezpecnost operaci na internetu. Tyto servery poskituji korenovy zonovy soubor (root zone file) ostatnim DNS serverum. Jsou soucasti DNS, celosvetove distibuovane databaze ktera slouzi k prekladu unikatnich domenovych jmen na ostatni identifikatory </p><ul class="list _bullet" id="i7tdl9j_8"><li class="list__item" id="i7tdl9j_9"><p>Korenovy zonovy soubor popisuje, kde se nachazeji autoritativni servery pro domeny nejvyssi urovne. Tento korenovy zonovy soubor je relativne velmi maly a casto se nemeni - operatori root serveru ho pouze zpristupnuji, samotny soubor je vytvaren a menem organizaci IANA.</p></li></ul></li></ul><figure id="i7tdl9j_10"><img alt="domain-explained.png" src="images/domain-explained.png" title="domain-explained.png" width="1248" height="702"></figure><section class="chapter"><h3 id="zpusob-ziskavani-ip-adresy" data-toc="zpusob-ziskavani-ip-adresy">Zpusob ziskavani IP adresy</h3><ol class="list _decimal" id="i7tdl9j_11" type="1"><li class="list__item" id="i7tdl9j_12"><p>Uzivatel zadal do sveho WWW klienta domenove jmeno www.wikipedia.org. Resolver v pocitaci se obratil na lokalni DNS server s dotazem na IP adresu pro www.wikipedia.org.</p></li><li class="list__item" id="i7tdl9j_13"><p>Lokalni DNS server tuto informaci nezna. Ma vsak k dispozici adresy korenovych serveru. Na jeden z nich se obrati (rekneme na 193.0.14.129) a dotaz mu preposle.</p></li><li class="list__item" id="i7tdl9j_14"><p>Korenovy server take nezna odpoved. Vi vsak, ze existuje domena nejvyssi urovne org a jake jsou jeji autoritativni servery, jejich adresy tazateli poskytne.</p></li><li class="list__item" id="i7tdl9j_15"><p>Lokalni server jeden z nich vybere (rekneme, ze zvoli tld1.ultradns.net s IP adresou 204.74.112.1) a posle mu dotaz na IP adresu ke jmenu www.wikipedia.org.</p></li><li class="list__item" id="i7tdl9j_16"><p>Osloveny server informaci opet nezna, ale poskytne IP adresy autoritativnich serveru pro domenu wikipedia.org. Jsou to ns0.wikimedia.org(207.142.131.207), ns1.wikimedia.org(211.115.107.190) a ns2.wikimedia.org(145.97.39.158).</p></li><li class="list__item" id="i7tdl9j_17"><p>Lokalni server opet jeden z nich vybere a posle mu dotaz na IP adresu ke jmenu www.wikipedia.org.</p></li><li class="list__item" id="i7tdl9j_18"><p>Jelikoz toto jmeno se jiz nachazi v domene wikipedia.org, dostane od jejiho serveru nepochybne autoritativni odpovedm ze hledana IP adresa zni 145.97.39.155.</p></li><li class="list__item" id="i7tdl9j_19"><p>Lokalni DNS server tuto odpoved preda uzivatelskemu pocitaci, ktery se na ni ptal.</p></li></ol><figure id="i7tdl9j_20"><img alt="getting-address-from-dns.png" src="images/getting-address-from-dns.png" title="getting-address-from-dns.png" width="780" height="367"></figure></section><section class="chapter"><h3 id="reverzni-dotaz" data-toc="reverzni-dotaz">Reverzni dotaz</h3><p id="i7tdl9j_21">Tento nesoulad resi DNS tak, ze pri reverznich dotazech obraci poradi bajtu v adrese. K obracene adrese pak pripoji domenu in-addr.arpa a vysledne &quot;jmeno&quot; pak vyhledava standartnim postupem. Hleda-li napriklad jmeno k IP adrese 145.97.39.155, vytvori dotaz na 155.39.97.145.in-addr.arpa. Obraceni IP adresy umoznuje delegovat spravu reverznich domen odpovidajicich sitim a podsitim spravcum dotycnych siti a podsiti. V prikladu pouzitou sit 145.90.0.0/16 spravuje nizozemsky SURFnet a ten ma take ve sprace ji odpovidajici domenu 97.145.in-addr.arpa. Kdykoli zavede do site novy pocitac, muze zaroven upravit data v reverzni domene, aby odpovidala skutecne situaci.</p></section><section class="chapter"><h3 id="zaznamy" data-toc="zaznamy">Zaznamy</h3><ul class="list _bullet" id="i7tdl9j_22"><li class="list__item" id="i7tdl9j_23"><p>A (address record) obsahuje IPv4 adresu prirazenou danemu jmenu, napriklad kdyz jmenu cosi.kdesi.cz nalezi IP adresa 1.2.3.4, bude zonovy soubor pro domenu kdesi.cz obsahovat zaznam: <code class="code" id="i7tdl9j_24">cosi IN A 1.2.3.4</code></p></li><li class="list__item" id="i7tdl9j_25"><p>AAAA (IPv6 address record) obsahuje IPv6 adresu. Zminenemu stroji bychom dali IPv6 addresu 2001:718::1 priradili zaznamem: <code class="code" id="i7tdl9j_26">cosi IN AAAA 2001:718::1</code></p></li><li class="list__item" id="i7tdl9j_27"><p>CNAME (canonical name record) je alias - jine jmeno pro jiz zavedene. Typicky se pouziva pro servery znamych sluzeb, jako je napriklad WWW. Jeho definice pomoci prezdivky umoznuje jej pozdeji snadno prestehovat na jiny pocitac. Pokud nas cosi.kdesi.cz ma slouzit zaroven jako www.kdesi.cz vlozime do zonoveho souboru: <code class="code" id="i7tdl9j_28">www IN CNAME cosi</code></p></li><li class="list__item" id="i7tdl9j_29"><p>MX (mail exchange record) oznamuje adresu a prioritu serveru pro prijem elektronicke posty pro danou domenu. Tentokrat jsou parametry dva- priorita (prirozene cislo, mensi znamena vyssi prioritu) a domenove jmeno serveru. Pokud postu pro pocitaci cosi.kdesi.cz prijima nejlepe pocitac mail.kdesi.cz a pripadne jako zalozni i mail.jinde.cz, bude zonovy soubor obsahovat zaznamy (vsimnete si pouziti jmen s teckou a bez tecky): <code class="code" id="i7tdl9j_30">cosi IN MX 10 mail</code> a <code class="code" id="i7tdl9j_31">IN MX 20 mail.jinde.cz</code></p></li><li class="list__item" id="i7tdl9j_32"><p>NS (name server record) ohlasuje jmeno autoritativniho DNS serveru pro danou domenu. Bude-li mit domena kdesi.cz poddomenu obchod.kdesi.cz, jejimz servery budou ns.kdesi.cz (primarni) a ns.jinde.cz (sekundarni), bude zonovy soubor pro kdesi.cz obsahovat: <code class="code" id="i7tdl9j_33">obchod IN NS ns</code> a <code class="code" id="i7tdl9j_34">IN NS ns.jinde.cz</code></p></li><li class="list__item" id="i7tdl9j_35"><p>PTR (pointer record) je specialni typ zaznamu pro reverzni zony. Obsahuje na prave strane jmeno pocitace pridelene adrese na strane leve (adresa je transformovana na domanu vyse popsanym postupem). Drzme se naseho prikladu pro zaznam typu A - v souladu s nim by zonovy soubor pro domenu 3.2.1.in-addr.arpa mel obsahovat (zonovy soubor definuje reverzni domenu, proto je treba psat na prave strane kompletni jmeno s teckou, jinak by za ne pripojil reverzni domenu): <code class="code" id="i7tdl9j_36">4 IN PTR cosi.kdesi.cz</code></p></li><li class="list__item" id="i7tdl9j_37"><p>SOA record: SOA stand for &quot;start of authority&quot; It's an important DNS record type that stores admin information about a domain. This information includes the email address of the admin and when the domain was last updated.</p></li><li class="list__item" id="i7tdl9j_38"><p>TXT record: TXT stands for &quot;text&quot;, and this record type lets the owner ofa domain store text values in the DNS. Several servuces use this record to verify ownership of a domain.</p></li><li class="list__item" id="i7tdl9j_39"><p>PTR record: A pointer (PTR) record provides a domain name for reverse lookup. It's the opposite of an A record as it provides the domain name linked to an IP address instead of the IP address for a domain.</p></li><li class="list__item" id="i7tdl9j_40"><p>SRV record: Using this DNS record type, it's possible to store the IP address and port for specific services.</p></li><li class="list__item" id="i7tdl9j_41"><p>CERT record: This record type stores public keys certificates.</p></li><li class="list__item" id="i7tdl9j_42"><p>DCHID: This DNS record type stores information related to dynamic host configuration protocol (DHCP)</p></li><li class="list__item" id="i7tdl9j_43"><p>DNAME: The full meaning of DNAME is &quot;delegation name&quot;. This record type works very similarly to CNAME; however, it points all the subdomains for the alias to the canonical domain name. That is, pointing the DNAME for secondsite.com to example.com will also applu to staff.secondsite.com and any other subdomain.</p></li></ul><p id="i7tdl9j_44">Servery DNS jsou organizovany hierarchicky, stejne jako jsou hierarchicky tvoreny nazvy domen.</p></section><section class="chapter"><h3 id="dns-on-computer-file" data-toc="dns-on-computer-file">DNS on computer file</h3><ul class="list _bullet" id="i7tdl9j_45"><li class="list__item" id="i7tdl9j_46"><p>/etc/hosts ... on linux dns local file (ip domain)</p></li><li class="list__item" id="i7tdl9j_47"><p>/etc/resolve/conf ... definuje se adresa dns a domena</p></li><li class="list__item" id="i7tdl9j_48"><p>Hosts windows on dns local file Nejdrive zadny DNS server neexistoval, jen se udrzoval centralne jako jeden soubor ktery si uzivatele davali do /etc/hosts ale to se v jednu chvili stalo neudrzitelne a proto bylo potreba vymyslet nejakou alternativu. Tedy DNS decentralizovany system vznikl.</p></li></ul></section><section class="chapter"><h3 id="dns-server-konfigurace" data-toc="dns-server-konfigurace">DNS server konfigurace</h3><p id="i7tdl9j_49"><code class="code" id="i7tdl9j_50">sudo apt install dnsmasq</code> <code class="code" id="i7tdl9j_51">sudo nano /etc/dnsmasq.conf</code></p><div class="code-block" data-lang="none">
# Never forward plain names (without a domain)
domain-needed
# Turn off DHCP on eth0
no-dhcp-interface=eth0
# Never forward addresses in the non-routable address space (RFC1918)
bogus-priv
# Add domain to host names
expand-hosts
# Domain to be added if expand-hosts is set
domain=zola.home
# Local domain to be served from /etc/hosts file
local=/zola.home/
# Don't read /etc/resolv.conf (I deleted it). Get the external name server from this file, see 'server' below
no-resolv
# External server, works with no-resolv
server=8.8.8.8
</div></section></section><div class="last-modified">Last modified: 13 May 2024</div><div data-feedback-placeholder="true"></div><div class="navigation-links _bottom"><a href="dhcp6-funkce-možnosti-konfigurace-rozsahy-ip-adres-dle-mac-adresy-použití.html" class="navigation-links__prev">DHCP6 - funkce, možnosti konfigurace (rozsahy IP adres, dle MAC adresy), použit&iacute;</a><a href="zabezpečení-datových-sítí-filtrace-provozu-firewall-nat.html" class="navigation-links__next">Zabezpečen&iacute; datov&yacute;ch s&iacute;t&iacute; - Filtrace provozu, Firewall, NAT</a></div></article><div id="disqus_thread"></div></div></section></main></div><script src="https://resources.jetbrains.com/writerside/apidoc/6.10.0-b259/app.js"></script></body></html>