<!DOCTYPE html SYSTEM "about:legacy-compat">
<html lang="en-US" data-preset="contrast" data-primary-color="#307FFF"><head><meta http-equiv="Content-Type" content="text/html; charset=UTF-8"><meta charset="UTF-8"><meta name="robots" content="noindex"><meta name="built-on" content="2024-05-19T11:29:19.3695535"><title>SSL/TLS, RSA - Symetrick&eacute; a asymetrick&eacute; &scaron;ifrov&aacute;n&iacute;, SSL/TLS handshake. Certifikačn&iacute; autority. Princip ověřen&iacute; pravosti kl&iacute;če | Maturita</title><script type="application/json" id="virtual-toc-data">[{"id":"ssl-tls","level":0,"title":"SSL/TLS","anchor":"#ssl-tls"},{"id":"tls-vs-ssl","level":0,"title":"TLS VS SSL","anchor":"#tls-vs-ssl"},{"id":"tls-handshake","level":0,"title":"TLS Handshake","anchor":"#tls-handshake"},{"id":"symetricke-a-asymetricke-sifrovani","level":0,"title":"Symetricke a Asymetricke sifrovani","anchor":"#symetricke-a-asymetricke-sifrovani"},{"id":"certifikacni-autorita","level":0,"title":"Certifikacni autorita","anchor":"#certifikacni-autorita"}]</script><script type="application/json" id="topic-shortcuts"></script><link href="https://resources.jetbrains.com/writerside/apidoc/6.10.0-b259/app.css" rel="stylesheet"><meta name="msapplication-TileColor" content="#000000"><link rel="apple-touch-icon" sizes="180x180" href="https://jetbrains.com/apple-touch-icon.png"><link rel="icon" type="image/png" sizes="32x32" href="https://jetbrains.com/favicon-32x32.png"><link rel="icon" type="image/png" sizes="16x16" href="https://jetbrains.com/favicon-16x16.png"><meta name="msapplication-TileImage" content="https://resources.jetbrains.com/storage/ui/favicons/mstile-144x144.png"><meta name="msapplication-square70x70logo" content="https://resources.jetbrains.com/storage/ui/favicons/mstile-70x70.png"><meta name="msapplication-square150x150logo" content="https://resources.jetbrains.com/storage/ui/favicons/mstile-150x150.png"><meta name="msapplication-wide310x150logo" content="https://resources.jetbrains.com/storage/ui/favicons/mstile-310x150.png"><meta name="msapplication-square310x310logo" content="https://resources.jetbrains.com/storage/ui/favicons/mstile-310x310.png"><meta name="image" content=""><!-- Open Graph --><meta property="og:title" content="SSL/TLS, RSA - Symetrick&eacute; a asymetrick&eacute; &scaron;ifrov&aacute;n&iacute;, SSL/TLS handshake. Certifikačn&iacute; autority. Princip ověřen&iacute; pravosti kl&iacute;če | Maturita"><meta property="og:description" content=""><meta property="og:image" content=""><meta property="og:site_name" content="Maturita Help"><meta property="og:type" content="website"><meta property="og:locale" content="en_US"><meta property="og:url" content="writerside-documentation//20.24/ssl-tls-rsa-symetrické-a-asymetrické-šifrování-ssl-tls-handshake-certifikační-autority-princip-ověření-pravosti-klíče.html"><!-- End Open Graph --><!-- Twitter Card --><meta name="twitter:card" content="summary_large_image"><meta name="twitter:site" content=""><meta name="twitter:title" content="SSL/TLS, RSA - Symetrick&eacute; a asymetrick&eacute; &scaron;ifrov&aacute;n&iacute;, SSL/TLS handshake. Certifikačn&iacute; autority. Princip ověřen&iacute; pravosti kl&iacute;če | Maturita"><meta name="twitter:description" content=""><meta name="twitter:creator" content=""><meta name="twitter:image:src" content=""><!-- End Twitter Card --><!-- Schema.org WebPage --><script type="application/ld+json">{
    "@context": "http://schema.org",
    "@type": "WebPage",
    "@id": "writerside-documentation//20.24/ssl-tls-rsa-symetrické-a-asymetrické-šifrování-ssl-tls-handshake-certifikační-autority-princip-ověření-pravosti-klíče.html#webpage",
    "url": "writerside-documentation//20.24/ssl-tls-rsa-symetrické-a-asymetrické-šifrování-ssl-tls-handshake-certifikační-autority-princip-ověření-pravosti-klíče.html",
    "name": "SSL/TLS, RSA - Symetrick&eacute; a asymetrick&eacute; &scaron;ifrov&aacute;n&iacute;, SSL/TLS handshake. Certifikačn&iacute; autority. Princip ověřen&iacute; pravosti kl&iacute;če | Maturita",
    "description": "",
    "image": "",
    "inLanguage":"en-US"
}</script><!-- End Schema.org --><!-- Schema.org WebSite --><script type="application/ld+json">{
    "@type": "WebSite",
    "@id": "writerside-documentation/#website",
    "url": "writerside-documentation/",
    "name": "Maturita Help"
}</script><!-- End Schema.org --></head><body data-id="SSL-TLS-RSA-Symetrické-a-asymetrické-šifrování-SSL-TLS-handshake-Certifikační-autority-Princip-ověření-pravosti-klíče" data-main-title="SSL/TLS, RSA - Symetrické a asymetrické šifrování, SSL/TLS handshake. Certifikační autority. Princip ověření pravosti klíče" data-article-props="{&quot;seeAlsoStyle&quot;:&quot;links&quot;}" data-template="article" data-breadcrumbs="Questions.md|PSS"><div class="wrapper"><main class="panel _main"><header class="panel__header"><div class="container"><h3>Maturita 20.24 Help</h3><div class="panel-trigger"></div></div></header><section class="panel__content"><div class="container"><article class="article" data-shortcut-switcher="inactive"><h1 data-toc="SSL-TLS-RSA-Symetrické-a-asymetrické-šifrování-SSL-TLS-handshake-Certifikační-autority-Princip-ověření-pravosti-klíče" id="SSL-TLS-RSA-Symetrické-a-asymetrické-šifrování-SSL-TLS-handshake-Certifikační-autority-Princip-ověření-pravosti-klíče.md">SSL/TLS, RSA - Symetrické a asymetrické šifrování, SSL/TLS handshake. Certifikační autority. Princip ověření pravosti klíče</h1><section class="chapter"><h2 id="ssl-tls" data-toc="ssl-tls">SSL/TLS</h2><p id="i65676l_2">TLS (Transport Layer Security) jedn&aacute; se o kryptografick&yacute; protokol SSL (Secure Sockets Layer) je jeho předchůdcem a maj&iacute; za &uacute;kol poskytnou bezpečnou komunikaci přes internet. Tento protokol je velmi použ&iacute;van&yacute; ve služb&yacute;ch jako jsou email, VOIP (voice over ip), HTTPS. Samotn&eacute; SSL se již moc nepouž&iacute;v&aacute; jen v někter&yacute;ch zastaral&yacute;ch aplikac&iacute;ch. Modern&iacute; svět postupně pře&scaron;el na TLS.</p><p id="i65676l_3">TLS se zaměřuje na poskytov&aacute;n&iacute; securitz, including privacy (confidentiality), integrity a ověřov&aacute;n&iacute; použit&iacute;m cryptography, jako jsou např&iacute;klad certifik&aacute;ty, mezi dvěma nebo v&iacute;ce aplikacemi.</p></section><section class="chapter"><h2 id="tls-vs-ssl" data-toc="tls-vs-ssl">TLS VS SSL</h2><div class="table-wrapper"><table class="wide" id="i65676l_4"><thead><tr class="ijRowHead" id="i65676l_5"><th id="i65676l_6"><p>SSL</p></th><th id="i65676l_7"><p>TLS</p></th></tr></thead><tbody><tr id="i65676l_8"><td id="i65676l_9"><p>SSL stands for Secure Socket Layer.</p></td><td id="i65676l_10"><p>TLS stands for Transport Layer Security.</p></td></tr><tr id="i65676l_11"><td id="i65676l_12"><p>SSL supports the Fortezza algorithm.</p></td><td id="i65676l_13"><p>TLS does not support the Fortezza algorithm.</p></td></tr><tr id="i65676l_14"><td id="i65676l_15"><p>SSL is the 3.0 version.</p></td><td id="i65676l_16"><p>TLS is the 1.0 version.</p></td></tr><tr id="i65676l_17"><td id="i65676l_18"><p>In SSL the Message digest is used to create a master secret.</p></td><td id="i65676l_19"><p>In TLS a Pseudo-random function is used to create a master secret.</p></td></tr><tr id="i65676l_20"><td id="i65676l_21"><p>In SSL, the Message Authentication Code protocol is used.</p></td><td id="i65676l_22"><p>In TLS Hashed Message Authentication code protocol is used.</p></td></tr><tr id="i65676l_23"><td id="i65676l_24"><p>SSL is more complex than TLS</p></td><td id="i65676l_25"><p>TLS is simple.</p></td></tr><tr id="i65676l_26"><td id="i65676l_27"><p>SSL is less secured as compared to TLS</p></td><td id="i65676l_28"><p>TLS provides high security.</p></td></tr><tr id="i65676l_29"><td id="i65676l_30"><p>SSL is less reliable and slower.</p></td><td id="i65676l_31"><p>TLS is highly reliable and upgraded. It provides less latency.</p></td></tr><tr id="i65676l_32"><td id="i65676l_33"><p>SSL has been depreciated</p></td><td id="i65676l_34"><p>TLS is still widely used.</p></td></tr><tr id="i65676l_35"><td id="i65676l_36"><p>SSL uses port to set up explicit connection.</p></td><td id="i65676l_37"><p>TLS uses protocol to set up implicit connection.</p></td></tr></tbody></table></div></section><section class="chapter"><h2 id="tls-handshake" data-toc="tls-handshake">TLS Handshake</h2><figure id="i65676l_38"><img alt="TLS-handshake.png" src="images/TLS-handshake.png" title="TLS-handshake.png" width="1394" height="797"></figure><section class="chapter"><h3 id="proc-probiha-tls-handshake" data-toc="proc-probiha-tls-handshake">Proc probiha TLS handshake</h3><ul class="list _bullet" id="i65676l_39"><li class="list__item" id="i65676l_40"><p>Urceni jaka verze TLS se bude pouzivat (TLS 1.0, 1.2, 1.3, etc.)</p></li><li class="list__item" id="i65676l_41"><p>Urcuji jaky cipher suite se bude pouzivat </p><ul class="list _bullet" id="i65676l_42"><li class="list__item" id="i65676l_43"><p>Cipher suite je skupina algoritmu ktera vytvari sifrovane komunikacni spojeni</p></li><li class="list__item" id="i65676l_44"><p>Key exchange algorithm, a bulk encryption algorithm and a message authentication code (MAC) algorithm</p></li></ul></li><li class="list__item" id="i65676l_45"><p>Autentifikace identity za pomoci server public key a SSL certifikatu schvaleneho autoritou</p></li><li class="list__item" id="i65676l_46"><p>Generuji session key za ucelem symetrickeho sifrovani pote co handshake probehne Prubeh handshake bude zaviset na tom jaky key exchange algoritmus se bude pouzivat a jaky cipher suite podporuji obe dve strany. Vsechny TLS handshaky vyuzivaji asymetricke sifrovani pro komunikaci</p></li></ul></section><section class="chapter"><h3 id="postup-komunikace" data-toc="postup-komunikace">Postup komunikace</h3><ol class="list _decimal" id="i65676l_47" type="1"><li class="list__item" id="i65676l_48"><p>The 'client hello' message: Klient zapocina handshake tim ze posila &quot;hello&quot; message server. Message obsahuje jakou TLS verzi klient podporuje, jakou cipher suite klient podporuje a retezec nahodnych bajtu &quot;client random&quot;.</p></li><li class="list__item" id="i65676l_49"><p>The 'server hello ' message: Jako odpoved na klientovo &quot;hello&quot; server posila message obsahujici jeho SSL certifikat, server podporovany cipher suite a &quot;server random&quot;, znovu nahodne vygenerovany tentokrat serverem</p></li><li class="list__item" id="i65676l_50"><p>Authentication: Klient overi SSL certifikat za pomoci certifikacni autority ktera ho pouziva. Tim potvrdi svoji totoznost a trustworthy server.</p></li><li class="list__item" id="i65676l_51"><p>The premaster secret: Klient posila jeden dalsi nahodny retezec bajtu... &quot;premaster secret&quot;. &quot;Premaster secret&quot; je sifrovany pomoci public key a muze byt desifrovany za pomoci private key ktery ma server. (Public klic dostane z ssl certifikatu)</p></li><li class="list__item" id="i65676l_52"><p>Private key used: Server desifruje &quot;Premaster secret&quot;</p></li><li class="list__item" id="i65676l_53"><p>Session keys created: Oba klient i sever vygeneruji session key z &quot;client random&quot;, &quot;server random&quot; a &quot;Premaster secret&quot;, Meli by dojit ke stejnemu vysledku</p></li><li class="list__item" id="i65676l_54"><p>Client is ready: Klient posle &quot;finished&quot; message ktera je zasifrovana pomoci session key.</p></li><li class="list__item" id="i65676l_55"><p>Server is ready: Server posle &quot;finished&quot; message zasifrovanou pomoci session key.</p></li><li class="list__item" id="i65676l_56"><p>Secure symmetric encryption achieved: Handshake je u konce, komunikace muze pokracovat kde se bude vyuzivat session key pro symetricke sifrovani</p></li></ol></section></section><section class="chapter"><h2 id="symetricke-a-asymetricke-sifrovani" data-toc="symetricke-a-asymetricke-sifrovani">Symetricke a Asymetricke sifrovani</h2><p id="i65676l_57">Principem &scaron;ifrov&aacute;n&iacute; je převod čiteln&yacute;ch dat na nečiteln&aacute; data. Zpětn&yacute; převod z nečiteln&yacute;ch dat na čiteln&aacute; data se naz&yacute;v&aacute; de&scaron;ifrov&aacute;n&iacute;. &Scaron;ifrovat mohu jak data, kter&aacute; si chci ponechat na sv&eacute;m zař&iacute;zen&iacute; (aby si je nemohl přeč&iacute;st př&iacute;padn&yacute; &uacute;točn&iacute;k, kter&yacute; se jich zmocn&iacute;), tak předev&scaron;&iacute;m data, kter&aacute; chci zaslat někomu dal&scaron;&iacute;mu (&scaron;ance na zachycen&iacute; dat přen&aacute;&scaron;en&yacute;ch přes Internet je poměrně vysok&aacute; &ndash; &scaron;ifrov&aacute;n&iacute;m zajist&iacute;m, že zachycen&aacute; data nebude možn&eacute; zneuž&iacute;t).</p><section class="chapter"><h3 id="symetricke" data-toc="symetricke">Symetricke</h3><p id="i65676l_58">Různ&eacute; techniky &scaron;ifrov&aacute;n&iacute; stoj&iacute; na odli&scaron;n&yacute;ch matematick&yacute;ch z&aacute;kladech, ale vět&scaron;ina z nich pracuje se &scaron;ifrovac&iacute;mi kl&iacute;či. V př&iacute;padě symetrick&eacute;ho &scaron;ifrov&aacute;n&iacute; se tent&yacute;ž kl&iacute;č použ&iacute;v&aacute; jak pro &scaron;ifrov&aacute;n&iacute;, tak i pro de&scaron;ifrov&aacute;n&iacute;. Postup symetrick&eacute;ho &scaron;ifrov&aacute;n&iacute; je poměrně jednoduch&yacute;. Odes&iacute;latel a př&iacute;jemce se nejprve domluv&iacute; na kl&iacute;či, tedy na sekvenci znaků (nejl&eacute;pe bez re&aacute;ln&eacute;ho v&yacute;znamu). Odes&iacute;latel zpr&aacute;vu za&scaron;ifruje, za&scaron;le ji př&iacute;jemci a ten si ji de&scaron;ifruje.</p></section><section class="chapter"><h3 id="asymetricke" data-toc="asymetricke">Asymetricke</h3><p id="i65676l_59">Slabinu symetrick&eacute;ho &scaron;ifrov&aacute;n&iacute; &ndash; tedy nutnost sd&iacute;len&iacute; &scaron;ifrovac&iacute;ho kl&iacute;če &ndash; ře&scaron;&iacute; asymetrick&eacute; &scaron;ifrov&aacute;n&iacute;. Při něm se použ&iacute;vaj&iacute; dva kl&iacute;če &ndash; jeden pro &scaron;ifrov&aacute;n&iacute; a druh&yacute; pro de&scaron;ifrov&aacute;n&iacute;. Chce-li odes&iacute;latel poslat př&iacute;jemci za&scaron;ifrovanou zpr&aacute;vu, tak nejprve odes&iacute;latel pož&aacute;d&aacute; př&iacute;jemce o jeho &scaron;ifrovac&iacute; kl&iacute;č. T&iacute;mto kl&iacute;čem za&scaron;ifruje zpr&aacute;vu a ode&scaron;le ji. Př&iacute;jemce si pak zpr&aacute;vu sv&yacute;m de&scaron;ifrovac&iacute;m kl&iacute;čem de&scaron;ifruje. Znalost pouh&eacute;ho &scaron;ifrovac&iacute;ho kl&iacute;če neumožňuje de&scaron;ifrov&aacute;n&iacute; zpr&aacute;v, a tak je možn&eacute; tento kl&iacute;č bez rizika poslat i přes běžn&eacute; nezabezpečen&eacute; připojen&iacute;. Tomuto kl&iacute;či se proto ř&iacute;k&aacute; veřejn&yacute; kl&iacute;č. De&scaron;ifrovac&iacute; kl&iacute;č je naproti tomu potřeba uchovat v tajnosti &ndash; ř&iacute;k&aacute; se mu proto soukrom&yacute; kl&iacute;č.</p></section><section class="chapter"><h3 id="rsa-inicialy-rivest-shamir-adleman" data-toc="rsa-inicialy-rivest-shamir-adleman">RSA (inicialy Rivest-Shamir-Adleman)</h3><p id="i65676l_60">Jeden z nejstar&scaron;&iacute;ch public-key kryptografick&yacute;ch syst&eacute;mů, kter&yacute; se použ&iacute;v&aacute; pro bezpečn&yacute; přenos dat. V tomto algoritmu je &scaron;ifrovac&iacute; kl&yacute;č public a li&scaron;&iacute; se od de&scaron;ifrovac&iacute;ho. Použ&iacute;v&aacute; se i dnes, přičemž při dostatečn&eacute; d&eacute;lce kl&iacute;če je považov&aacute;n za bezpečn&yacute;. Je založen na principu že je složit&eacute; rozložit velk&eacute; č&iacute;slo na součin prvoč&iacute;sel. Naproti tomu n&aacute;soben&iacute; dvou velk&yacute;ch č&iacute;sel je element&aacute;rn&iacute; &uacute;loha.</p></section></section><section class="chapter"><h2 id="certifikacni-autorita" data-toc="certifikacni-autorita">Certifikacni autorita</h2><p id="i65676l_61">Certifikačn&iacute; autorita (zkratka CA) je v asymetrick&eacute; kryptografii subjekt, kter&yacute; vyd&aacute;v&aacute; digit&aacute;ln&iacute; certifik&aacute;ty ( elektronicky podepsan&eacute; veřejn&eacute; &scaron;ifrovac&iacute; kl&iacute;če), č&iacute;mž usnadňuje využ&iacute;v&aacute;n&iacute; PKI (Public Key Infrastructure) tak, že svoj&iacute; autoritou potvrzuje pravdivost &uacute;dajů, kter&eacute; jsou ve volně dostupn&eacute;m veřejn&eacute;m kl&iacute;či uvedeny. Na z&aacute;kladě principu přenosu důvěry (viz n&iacute;že) tak můžeme důvěřovat &uacute;dajům uveden&yacute;m v digit&aacute;ln&iacute;m certifik&aacute;tu za předpokladu, že důvěřujeme samotn&eacute; certifikačn&iacute; autoritě. Certifik&aacute;t autorita podepisuje za pomoc&iacute; priv&aacute;tn&iacute;ho kl&iacute;če. N&aacute;sledně pak když si chci ověřit že je podpis důvěryhodn&yacute; porovn&aacute;m ho s publik key kter&yacute; už v dne&scaron;n&iacute; době mohou b&yacute;t př&iacute;mo v prohl&iacute;žeči. V&scaron;e zpoč&iacute;v&aacute; na důvěře v Certifikačn&iacute; autoritu když chceme zjistit validitu SSL certifik&aacute;tu.</p><ul class="list _bullet" id="i65676l_62"><li class="list__item" id="i65676l_63"><p>Stahov&aacute;n&iacute; certifikačn&iacute;ch řetězců: Spolu s certifik&aacute;tem obdrž&iacute;te tak&eacute; certifikačn&iacute; řetězce. Certifikačn&iacute; řetězec obsahuje certifik&aacute;t vyd&aacute;vaj&iacute;c&iacute; autority (tzv. kořenov&eacute; certifik&aacute;ty), kter&eacute; jsou považov&aacute;ny za důvěryhodn&eacute;. Prohl&iacute;žeč potřebuje tyto kořenov&eacute; certifik&aacute;ty, aby mohl ověřit důvěryhodnost certifik&aacute;tu, kter&yacute; jste obdrželi.</p></li><li class="list__item" id="i65676l_64"><p>Verifikace digit&aacute;ln&iacute;ho podpisu: Prohl&iacute;žeč zkontroluje platnost digit&aacute;ln&iacute;ho podpisu na certifik&aacute;tu. Proces zahrnuje ověřen&iacute;, zda digit&aacute;ln&iacute; podpis byl vygenerov&aacute;n pomoc&iacute; priv&aacute;tn&iacute;ho kl&iacute;če vyd&aacute;vaj&iacute;c&iacute; autority, a zda je certifik&aacute;t platn&yacute;.</p></li><li class="list__item" id="i65676l_65"><p>Kontrola důvěryhodnosti vyd&aacute;vaj&iacute;c&iacute; autority: Prohl&iacute;žeč zkontroluje, zda je vyd&aacute;vaj&iacute;c&iacute; autorita, kter&aacute; podepsala certifik&aacute;t, uvedena v certifikačn&iacute;m řetězci a zda je považov&aacute;na za důvěryhodnou. Pokud je vyd&aacute;vaj&iacute;c&iacute; autorita důvěryhodn&aacute;, prohl&iacute;žeč přijme certifik&aacute;t jako důvěryhodn&yacute; </p><figure id="i65676l_66"><img alt="CA.png" src="images/CA.png" title="CA.png" width="348" height="548"></figure></li></ul></section><div class="last-modified">Last modified: 19 May 2024</div><div data-feedback-placeholder="true"></div><div class="navigation-links _bottom"><a href="hypertextové-schéma-http-hlavičky-http-autentifikace-http2-rozdíly-oproti-http1-1-webové-služby.html" class="navigation-links__prev">Hypertextov&eacute; sch&eacute;ma HTTP - hlavičky, HTTP autentifikace, HTTP2 - rozd&iacute;ly oproti HTTP1.1. Webov&eacute; služby</a><a href="imap-smtp-princip-odesílání-pošty-synchronizace-poštovních-schránek-se-serverem.html" class="navigation-links__next">IMAP, SMTP - princip odes&iacute;l&aacute;n&iacute; po&scaron;ty, synchronizace po&scaron;tovn&iacute;ch schr&aacute;nek se serverem</a></div></article><div id="disqus_thread"></div></div></section></main></div><script src="https://resources.jetbrains.com/writerside/apidoc/6.10.0-b259/app.js"></script></body></html>