<!DOCTYPE html SYSTEM "about:legacy-compat">
<html lang="en-US" data-preset="contrast" data-primary-color="#307FFF"><head><meta http-equiv="Content-Type" content="text/html; charset=UTF-8"><meta charset="UTF-8"><meta name="robots" content="noindex"><meta name="built-on" content="2024-05-13T21:24:22.7947098"><title>Teorie OS - fungov&aacute;n&iacute; OS, struktura OS, spr&aacute;va procesů, pseudoparalelismus | Maturita</title><script type="application/json" id="virtual-toc-data">[{"id":"fungovani-os","level":0,"title":"Fungovani OS","anchor":"#fungovani-os"},{"id":"struktura-os","level":0,"title":"Struktura OS","anchor":"#struktura-os"},{"id":"jadro-os","level":0,"title":"Jadro OS","anchor":"#jadro-os"},{"id":"sprava-procesu","level":0,"title":"Sprava procesu","anchor":"#sprava-procesu"}]</script><script type="application/json" id="topic-shortcuts"></script><link href="https://resources.jetbrains.com/writerside/apidoc/6.10.0-b259/app.css" rel="stylesheet"><meta name="msapplication-TileColor" content="#000000"><link rel="apple-touch-icon" sizes="180x180" href="https://jetbrains.com/apple-touch-icon.png"><link rel="icon" type="image/png" sizes="32x32" href="https://jetbrains.com/favicon-32x32.png"><link rel="icon" type="image/png" sizes="16x16" href="https://jetbrains.com/favicon-16x16.png"><meta name="msapplication-TileImage" content="https://resources.jetbrains.com/storage/ui/favicons/mstile-144x144.png"><meta name="msapplication-square70x70logo" content="https://resources.jetbrains.com/storage/ui/favicons/mstile-70x70.png"><meta name="msapplication-square150x150logo" content="https://resources.jetbrains.com/storage/ui/favicons/mstile-150x150.png"><meta name="msapplication-wide310x150logo" content="https://resources.jetbrains.com/storage/ui/favicons/mstile-310x150.png"><meta name="msapplication-square310x310logo" content="https://resources.jetbrains.com/storage/ui/favicons/mstile-310x310.png"><meta name="image" content=""><!-- Open Graph --><meta property="og:title" content="Teorie OS - fungov&aacute;n&iacute; OS, struktura OS, spr&aacute;va procesů, pseudoparalelismus | Maturita"><meta property="og:description" content=""><meta property="og:image" content=""><meta property="og:site_name" content="Maturita Help"><meta property="og:type" content="website"><meta property="og:locale" content="en_US"><meta property="og:url" content="writerside-documentation//20.24/teorie-os-fungování-os-struktura-os-správa-procesů-pseudoparalelismus.html"><!-- End Open Graph --><!-- Twitter Card --><meta name="twitter:card" content="summary_large_image"><meta name="twitter:site" content=""><meta name="twitter:title" content="Teorie OS - fungov&aacute;n&iacute; OS, struktura OS, spr&aacute;va procesů, pseudoparalelismus | Maturita"><meta name="twitter:description" content=""><meta name="twitter:creator" content=""><meta name="twitter:image:src" content=""><!-- End Twitter Card --><!-- Schema.org WebPage --><script type="application/ld+json">{
    "@context": "http://schema.org",
    "@type": "WebPage",
    "@id": "writerside-documentation//20.24/teorie-os-fungování-os-struktura-os-správa-procesů-pseudoparalelismus.html#webpage",
    "url": "writerside-documentation//20.24/teorie-os-fungování-os-struktura-os-správa-procesů-pseudoparalelismus.html",
    "name": "Teorie OS - fungov&aacute;n&iacute; OS, struktura OS, spr&aacute;va procesů, pseudoparalelismus | Maturita",
    "description": "",
    "image": "",
    "inLanguage":"en-US"
}</script><!-- End Schema.org --><!-- Schema.org WebSite --><script type="application/ld+json">{
    "@type": "WebSite",
    "@id": "writerside-documentation/#website",
    "url": "writerside-documentation/",
    "name": "Maturita Help"
}</script><!-- End Schema.org --></head><body data-id="Teorie-OS-fungování-OS-struktura-OS-správa-procesů-pseudoparalelismus" data-main-title="Teorie OS - fungování OS, struktura OS, správa procesů, pseudoparalelismus" data-article-props="{&quot;seeAlsoStyle&quot;:&quot;links&quot;}" data-template="article" data-breadcrumbs="Questions.md|PSS"><div class="wrapper"><main class="panel _main"><header class="panel__header"><div class="container"><h3>Maturita 20.24 Help</h3><div class="panel-trigger"></div></div></header><section class="panel__content"><div class="container"><article class="article" data-shortcut-switcher="inactive"><h1 data-toc="Teorie-OS-fungování-OS-struktura-OS-správa-procesů-pseudoparalelismus" id="Teorie-OS-fungování-OS-struktura-OS-správa-procesů-pseudoparalelismus.md">Teorie OS - fungování OS, struktura OS, správa procesů, pseudoparalelismus</h1><section class="chapter"><h2 id="fungovani-os" data-toc="fungovani-os">Fungovani OS</h2><ul class="list _bullet" id="-927j5z_414"><li class="list__item" id="-927j5z_415"><p>Jadro (kernel): </p><ul class="list _bullet" id="-927j5z_416"><li class="list__item" id="-927j5z_417"><p>Jadro Linuxu je srdcem operacniho systemu. Zajistuje zakladni funkce jako rizeni pameti, spravu procesu, souborovy system, sitovou komunikaci a ovladace zarizeni.</p></li><li class="list__item" id="-927j5z_418"><p>Jadro je spusteno jako prvni cast operacniho systemu a prebira kontrolu nad hardwarem</p></li><li class="list__item" id="-927j5z_419"><p>Jadro provadi operace na nizke urovni, jako spravu pameti, planovani procesu, komunikaci se zarizenimi a souborovym systemem.</p></li></ul></li><li class="list__item" id="-927j5z_420"><p>Uzivatelsky prostor: </p><ul class="list _bullet" id="-927j5z_421"><li class="list__item" id="-927j5z_422"><p>Nad jadrem linuxu je uzivatelsky prostor, ve kterem bezi uzivatelske procesy a aplikace.</p></li><li class="list__item" id="-927j5z_423"><p>Uzivatelske procesy bezi v izolovanem prostredi a komunikuji s jadrem prostrednictvim systemovych volani (system calls)</p></li><li class="list__item" id="-927j5z_424"><p>Aplikace bezi ve virtualnim prostredi, ktere jim poskytuje abstrakci hardwaru a dalsi systemove zdroje, jako jsou knihovny, sitova rozhrani a souborovy system.</p></li></ul></li><li class="list__item" id="-927j5z_425"><p>Sprava procesu: </p><ul class="list _bullet" id="-927j5z_426"><li class="list__item" id="-927j5z_427"><p>Jadro spravuje spustene procesy v systemu.</p></li><li class="list__item" id="-927j5z_428"><p>Planovac procesu rozhoduje, ktery proces bude spusten, pozastaven nebo ukoncen a jak bude cas procesoru pridelovan jednotlivym procesum.</p></li><li class="list__item" id="-927j5z_429"><p>Jadro poskytuje mechanismy pro komunikaci a synchronizaci mezi procesy, jako jsou vlakna, semafory, fronty zprav apod.</p></li></ul></li><li class="list__item" id="-927j5z_430"><p>Sprava pameti: </p><ul class="list _bullet" id="-927j5z_431"><li class="list__item" id="-927j5z_432"><p>Jadro Linuxu spravuje pametovy prostor a alokuje pamet pro jednotlive procesy</p></li><li class="list__item" id="-927j5z_433"><p>Zajistuje virtualizaci pameti, ktera umoznuje kazdemu procesu videt svuj vlastni adresovy prostor.</p></li><li class="list__item" id="-927j5z_434"><p>Jadro resi spravu stranek v pameti, strankovani, vymenu stranek na disk a spravu docasne pameti (cache).</p></li></ul></li><li class="list__item" id="-927j5z_435"><p>Souborovy system: </p><ul class="list _bullet" id="-927j5z_436"><li class="list__item" id="-927j5z_437"><p>Jadro linuxu poskytuje abstrakci nad ruznymi typy souborovych systemu, ktere umoznuji pristup a praci se soubory a adresari</p></li><li class="list__item" id="-927j5z_438"><p>Souborovy system definuje strukturu datovych blokum, metadat a atributu souboru.</p></li><li class="list__item" id="-927j5z_439"><p>Linux podporuje ruzne souborove systemy, jako ext4, Btrfs, XFS, NTFS, FAT ktere mohou byt pouzity pro ruzna media, jako pevne disky, SSD, USB disky apod.</p></li><li class="list__item" id="-927j5z_440"><p>Jadro poskytuje rozhrani pro souborove operace, jako je cteni, zapis, vytvareni, mazani a prejmenovani souboru a adresaru.</p></li></ul></li></ul><section class="chapter"><h3 id="sitova-komunikace" data-toc="sitova-komunikace">Sitova Komunikace:</h3><ul class="list _bullet" id="-927j5z_441"><li class="list__item" id="-927j5z_442"><p>Jadro Linuxu poskytuje podporu pro sitovou komunikaci. (napr. TCP/IP)</p></li><li class="list__item" id="-927j5z_443"><p>Zahrnuje ovladace pro sitova zarizeni, protokoly pro sitovou komunikaci (napr. TCP/IP) a sitove rozhrani pro komunikaci s aplikacemi.</p></li><li class="list__item" id="-927j5z_444"><p>Jadro zajistuje prenos dat pres sit, smerovani paketu, spravu sitovych spojeni a poskytuje sitove sluzby, jako jsou sockety a sitove rozhrani</p></li></ul></section><section class="chapter"><h3 id="ovladace-zarizeni" data-toc="ovladace-zarizeni">Ovladace zarizeni:</h3><ul class="list _bullet" id="-927j5z_445"><li class="list__item" id="-927j5z_446"><p>Jadro linuxu obsahuje ovladace ozarizeni, ktere umoznuji komunikaci s hardwarem jako jsou klavesnice, mys, displeje, sitove karty, zvukove karty a dalsi periferni zarizeni.</p></li><li class="list__item" id="-927j5z_447"><p>Ovladace zarizeni jsou soucasti jadra a zprostredkovavaji komunikaci mezi hardwarem a operacnim systemem.</p></li></ul></section><section class="chapter"><h3 id="systemova-volani" data-toc="systemova-volani">Systemova volani:</h3><ul class="list _bullet" id="-927j5z_448"><li class="list__item" id="-927j5z_449"><p>Systemova volani jsou rozhranim mezi uzivatelskymi procesy a jadrem</p></li><li class="list__item" id="-927j5z_450"><p>Umoznuji uzivatelskym procesum komunikovat s jadrem a ziskavat pristup k jadrovym funkcim, jako je sprava procesu, souborovy system, sitova komunikace apod.</p></li><li class="list__item" id="-927j5z_451"><p>Priklady systemovych volani zahrnuji vytvareni procesu, otevirani a zavirani souboru, cteni a zapis dat, sitove operace a spravu pameti.</p></li></ul></section></section><section class="chapter"><h2 id="struktura-os" data-toc="struktura-os">Struktura OS</h2><figure id="-927j5z_452"><img alt="struktura-os.png" src="images/struktura-os.png" title="struktura-os.png" width="468" height="351"></figure><section class="chapter"><h3 id="ukoly-os" data-toc="ukoly-os">Ukoly OS:</h3><ul class="list _bullet" id="-927j5z_453"><li class="list__item" id="-927j5z_454"><p>Spoustet a dohlizet na uzivatelske programy</p></li><li class="list__item" id="-927j5z_455"><p>Efektivni vyuziti HW</p></li><li class="list__item" id="-927j5z_456"><p>Usnadnit reseni uzivatelskych problemu</p></li><li class="list__item" id="-927j5z_457"><p>Ucinit pocitact (snaze) pouzitelny</p></li></ul></section><section class="chapter"><h3 id="sklada-se-z-struktura" data-toc="sklada-se-z-struktura">Sklada se z  (struktura)</h3><ul class="list _bullet" id="-927j5z_458"><li class="list__item" id="-927j5z_459"><p>Jadro: Po zavedeni do pameti ridi cinnost pocitace, poskytuje procesum sluzby a resi spravu prostredku a spravu procesu</p></li><li class="list__item" id="-927j5z_460"><p>Ovladac: zvlastni (pod)program pro ovladani konkretniho zarizeni standardnim zpusobem. Pouziti strategie s ovladaci umoznuje snadnou konfigurovatelnost technickeho vybaveni.</p></li><li class="list__item" id="-927j5z_461"><p>Prikazovy procesor: program, ktery umoznuje uzivatelum zadavat prikazy ve specialnim obvykle jednoduchem jazyce.</p></li><li class="list__item" id="-927j5z_462"><p>Podpurne programy: do teto kategorie jsou mnohdy zahrnovany i prekladace (jazyk C v OS UNIX) a sestavujici programy. Stoji na stejnem miste jako aplikacni programy</p></li></ul></section></section><section class="chapter"><h2 id="jadro-os" data-toc="jadro-os">Jadro OS</h2><p id="-927j5z_463">Jadro se zpravidla deli na dve podstatne casti:</p><ul class="list _bullet" id="-927j5z_464"><li class="list__item" id="-927j5z_465"><p>Sprava procesu: sprava procesu (prakticky neni u jednoduchych OS) resi problematiku aktivovani a deaktivovani procesu podle jejich priority resp. pozadavku na prostredky.</p></li><li class="list__item" id="-927j5z_466"><p>Sprava prostredku: zajistuje cinnost V/V zarizeni, prideluje pamet, pripadne procesory. Velmi dulezitou casti spravy prostredku je: sprava souboru - zpusob ukladani souboru a pristupu k nim. Moderni OS zajistuji jednotny pohled na soubory a zarizeni. Zarizeni jsou povazovany za soubory se specialnim jmenem.</p></li></ul><section class="chapter"><h3 id="monoliticka-jadra-monolithic-kernel" data-toc="monoliticka-jadra-monolithic-kernel">Monoliticka jadra (Monolithic kernel)</h3><p id="-927j5z_467">V monolitick&eacute;m j&aacute;dru v&scaron;echny služby operačn&iacute;ho syst&eacute;mu běž&iacute; spolu s hlavn&iacute;m vl&aacute;knem j&aacute;dra a tedy i ve stejn&eacute; oblasti paměti. To umožňuje neomezen&yacute; a efektivn&iacute; př&iacute;stup k hardware. Mnoz&iacute; v&yacute;voj&aacute;ři zast&aacute;vaj&iacute; n&aacute;zor, že monolitick&eacute; syst&eacute;my je jednodu&scaron;&scaron;&iacute; navrhnout i implementovat než ostatn&iacute; ře&scaron;en&iacute; a jsou extr&eacute;mně &uacute;činn&eacute;, když jsou dobře napsan&eacute;. Hlavn&iacute; nev&yacute;hodou je z&aacute;vislost mezi syst&eacute;mov&yacute;mi komponentami &ndash; chyba v libovoln&eacute;m ovladači zař&iacute;zen&iacute; může shodit cel&yacute; syst&eacute;m &ndash; a fakt, že velk&aacute; j&aacute;dra mohou b&yacute;t těžko udržovateln&aacute;. <figure id="-927j5z_468"><img alt="kernel-software.png" src="images/kernel-software.png" title="kernel-software.png" width="283" height="213"></figure></p></section><section class="chapter"><h3 id="microkernel" data-toc="microkernel">Microkernel</h3><p id="-927j5z_469">Mikroj&aacute;dro poskytuje jen z&aacute;kladn&iacute; funkčnost nezbytnou pro vykon&aacute;v&aacute;n&iacute; služeb; vět&scaron;ina služeb je realizov&aacute;na specializovan&yacute;mi ovladači v uživatelsk&eacute;m prostoru. Mikroj&aacute;dro definuje jednoduch&eacute; abstrakce hardwaru se soupravou primitivn&iacute;ch funkc&iacute; nebo syst&eacute;mov&yacute;ch vol&aacute;n&iacute; implementuj&iacute;c&iacute;ch minim&aacute;ln&iacute; služby OS jako je spr&aacute;va paměti nebo meziprocesov&aacute; komunikace(IPC). Mikroj&aacute;dra jsou jednodu&scaron;&scaron;&iacute; než monolitick&aacute; j&aacute;dra, delegov&aacute;n&iacute; &uacute;kolů na ovladače v&scaron;ak snižuje efektivitu syst&eacute;mu, proto mus&iacute; b&yacute;t mikroj&aacute;dro navrženo tak, aby byl tento dopad minimalizov&aacute;n. <figure id="-927j5z_470"><img alt="microkernel.png" src="images/microkernel.png" title="microkernel.png" width="283" height="213"></figure></p></section></section><section class="chapter"><h2 id="sprava-procesu" data-toc="sprava-procesu">Sprava procesu</h2><ul class="list _bullet" id="-927j5z_471"><li class="list__item" id="-927j5z_472"><p>Proces: cinnost rizena programem, provedeni programu &quot;process&quot; nebo &quot;task&quot;</p></li><li class="list__item" id="-927j5z_473"><p>Proces potrebuje pro svou realizaci jiste zdroje (CPU, pamet, I/O zarizeni, ...)</p></li><li class="list__item" id="-927j5z_474"><p>Z hlediska spravy procesu je OS zodpovedny za: </p><ul class="list _bullet" id="-927j5z_475"><li class="list__item" id="-927j5z_476"><p>Vytvareni a ruseni procesu</p></li><li class="list__item" id="-927j5z_477"><p>Potlaceni a obnoveni procesu</p></li><li class="list__item" id="-927j5z_478"><p>Synchronizace procesu a jejich vzajemna komunikace</p></li></ul></li><li class="list__item" id="-927j5z_479"><p>Variantou procesu je tzv. Vlakno - jednotka planovani cinnosti definovana v programu. Vlakna pouzivaji zdroje pridelene procesu.</p></li></ul><section class="chapter"><h3 id="planovani-procesu" data-toc="planovani-procesu">Planovani procesu</h3><p id="-927j5z_480">Pl&aacute;nov&aacute;n&iacute; procesů (anglicky scheduling) je v informatice &uacute;kol j&aacute;dra operačn&iacute;ho syst&eacute;mu, ve kter&eacute;m je spu&scaron;těno v&iacute;ce procesů najednou. T&yacute;k&aacute; se tedy v&iacute;ce&uacute;lohov&yacute;ch syst&eacute;mů podporuj&iacute;c&iacute;ch multitasking anebo multithreading, kter&eacute; využ&iacute;vaj&iacute; paralelizmus anebo pseudoparalelizmus. Pl&aacute;nov&aacute;n&iacute; procesů ře&scaron;&iacute; v&yacute;běr, kter&eacute;mu n&aacute;sleduj&iacute;c&iacute;mu procesu bude přidělen procesor a proces tak poběž&iacute;, přičemž v&yacute;běr je z&aacute;visl&yacute; na priorit&aacute;ch jednotliv&yacute;ch procesů a algoritmu, kter&yacute;m v&yacute;běr proběhne.</p></section><section class="chapter"><h3 id="dlouhodobe-planovani" data-toc="dlouhodobe-planovani">Dlouhodobe planovani</h3><p id="-927j5z_481">Dlouhodob&eacute; pl&aacute;nov&aacute;n&iacute; (anglicky long-term) se označuje t&eacute;ž jako pl&aacute;nov&aacute;n&iacute; &uacute;loh (anglicky job scheduling) je v&yacute;běr, kter&aacute; &uacute;loha bude spu&scaron;těna. M&aacute; v&yacute;znam zejm&eacute;na u d&aacute;vkov&eacute;ho zpracov&aacute;n&iacute;. Jeho &uacute;čelem je napl&aacute;novat spou&scaron;těn&iacute; &uacute;loh tak, aby byl poč&iacute;tač maxim&aacute;lně využit, např&iacute;klad vhodn&eacute;ho mixu &uacute;loh, kter&eacute; jsou n&aacute;ročn&eacute; na I/O nebo CPU. V současn&eacute; době nen&iacute; obvykle u desktopov&yacute;ch syst&eacute;mů implementov&aacute;n, av&scaron;ak je velmi důležit&yacute; u operačn&iacute;ch syst&eacute;mů re&aacute;ln&eacute;ho času, protože syst&eacute;m by v př&iacute;padě spu&scaron;těn&iacute; v&iacute;ce procesů, než může bezpečně zvl&aacute;dnout, nemohl plnit garantovan&eacute; limity.</p></section><section class="chapter"><h3 id="strednedobe-planovani" data-toc="strednedobe-planovani">Strednedobe planovani</h3><p id="-927j5z_482">Střednědob&eacute; pl&aacute;nov&aacute;n&iacute; (anglicky mid-term) použ&iacute;vaj&iacute; syst&eacute;my s virtu&aacute;ln&iacute; pamět&iacute;. Jde o v&yacute;běr, kter&yacute; blokovan&yacute; nebo připraven&yacute; proces bude odsunut z vnitřn&iacute; paměti na pevn&yacute; disk, je-li vnitřn&iacute; paměti nedostatek (anglicky swapping out a swapping in). Je chybou považovat str&aacute;nkov&aacute;n&iacute; paměti za střednědob&eacute; pl&aacute;nov&aacute;n&iacute;, protože v tomto př&iacute;padě se odkl&aacute;d&aacute; cel&yacute; proces. Důvodem pro odložen&iacute; procesu může b&yacute;t absence aktivity procesu, n&iacute;zk&aacute; priorita, čast&eacute; v&yacute;padky str&aacute;nek, odblokovan&yacute; proces, kter&yacute; již neček&aacute; na syst&eacute;mov&eacute; prostředky nebo alokace př&iacute;li&scaron; velk&eacute; č&aacute;sti paměti, když je potřeba paměť pro jin&eacute; procesy.</p></section><section class="chapter"><h3 id="kratkodobe-planovani" data-toc="kratkodobe-planovani">Kratkodobe planovani</h3><p id="-927j5z_483">Kr&aacute;tkodob&eacute; pl&aacute;nov&aacute;n&iacute; (anglicky short-term) se označuje t&eacute;ž jako pl&aacute;nov&aacute;n&iacute; procesoru (anglicky CPU scheduling &ndash; viz dal&scaron;&iacute; odstavec), při němž se vyb&iacute;r&aacute;, kter&eacute;mu z připraven&yacute;ch procesů bude přidělen procesor. Použ&iacute;v&aacute; se ve v&scaron;ech v&iacute;ce&uacute;lohov&yacute;ch syst&eacute;mech. Při pl&aacute;nov&aacute;n&iacute; procesoru se v operačn&iacute;m syst&eacute;mu pl&aacute;novač (anglicky scheduler) rozhoduje, kter&eacute;mu procesu bude přidělen procesor, a tedy kter&yacute; proces v n&aacute;sleduj&iacute;c&iacute;m časov&eacute;m &uacute;seku bude procesor poč&iacute;tače využ&iacute;vat pro svůj běh. K pl&aacute;nov&aacute;n&iacute; procesoru doch&aacute;z&iacute; v n&aacute;sleduj&iacute;c&iacute;ch situac&iacute;ch (podrobnosti o stavech procesu viz čl&aacute;nek o procesech):</p><ul class="list _bullet" id="-927j5z_484"><li class="list__item" id="-927j5z_485"><p>pokud nektery bezici proces prejde do stavu blokovany</p></li><li class="list__item" id="-927j5z_486"><p>pokud nektery proces skonci</p></li><li class="list__item" id="-927j5z_487"><p>pokud je bezici proces preveden do stavu pripraveny</p></li><li class="list__item" id="-927j5z_488"><p>pokud je nektery proces preveden ze stavu blokovany do stavu pripraveny</p></li></ul></section><section class="chapter"><h3 id="pseudoparalelismus" data-toc="pseudoparalelismus">Pseudoparalelismus</h3><p id="-927j5z_489">Ve v&iacute;ce&uacute;lohov&yacute;ch syst&eacute;mech je obvykle k dispozici m&eacute;ně procesorů, než je procesů, kter&eacute; by měly z&aacute;roveň běžet. Proto se u takov&yacute;ch syst&eacute;mů využ&iacute;v&aacute; pseudoparalelismus, kter&yacute; umožňuje m&iacute;t zd&aacute;nlivě spu&scaron;těno z&aacute;roveň v&iacute;ce procesů. Procesy čekaj&iacute; ve frontě a postupně je jim na určitou dobu (tzv. časov&eacute; kvantum) přidělov&aacute;n procesor. Je-li přep&iacute;n&aacute;n&iacute; dostatečně rychl&eacute;, vznik&aacute; dojem, že procesy běž&iacute; z&aacute;roveň. K přep&iacute;n&aacute;n&iacute; doch&aacute;z&iacute; zhruba 100&ndash;1000kr&aacute;t za sekundu (podle v&yacute;konu poč&iacute;tače nebo podle v&yacute;&scaron;e režie přep&iacute;n&aacute;n&iacute;, kterou chceme obětovat ve prospěch plynulosti). Při přep&iacute;n&aacute;n&iacute; procesů je nutn&eacute;, aby proces po opětovn&eacute;m spu&scaron;těn&iacute; pokračoval od stejn&eacute;ho m&iacute;sta, ve kter&eacute;m byl přeru&scaron;en a aby v procesu až na časov&eacute; zpožděn&iacute; nebylo poznat, že k přeru&scaron;en&iacute; do&scaron;lo. Z tohoto důvodu je nutn&eacute; při přeru&scaron;en&iacute; vykon&aacute;v&aacute;n&iacute; procesu (mezi dvěma libovoln&yacute;mi strojov&yacute;mi instrukcemi) uschovat kompletn&iacute; stav procesoru a při opětovn&eacute;m přidělen&iacute; procesoru stejn&eacute;mu procesu tento stav kompletně obnovit. Kompletn&iacute; uložen&iacute; stavu procesu označujeme jako uložen&iacute; kontextu (anglicky context save) a obnoven&iacute; kontextu (anglicky context restore). Při v&yacute;měně procesů na procesoru doch&aacute;z&iacute; k uložen&iacute; kontextu jednoho a obnoven&iacute; kontextu druh&eacute;ho. Tuto činnost označujeme souhrnně jako změna kontextu (anglicky context switch).</p></section><section class="chapter"><h3 id="tabulka-popisu-procesu-pcb" data-toc="tabulka-popisu-procesu-pcb">Tabulka popisu procesu (PCB)</h3><p id="-927j5z_490">Tabulka popisu procesů (anglicky process control block, zkratka PCB) je datov&aacute; struktura v j&aacute;dře operačn&iacute;ho syst&eacute;mu, kter&aacute; uchov&aacute;v&aacute; data potřebn&aacute; k běhu procesu. Každ&yacute; proces m&aacute; svoji PCB, kter&aacute; je využ&iacute;v&aacute;na při změně kontextu(anglicky context switch) k uložen&iacute; stavu procesu.</p></section></section><div class="last-modified">Last modified: 13 May 2024</div><div data-feedback-placeholder="true"></div><div class="navigation-links _bottom"><a href="imap-smtp-princip-odesílání-pošty-synchronizace-poštovních-schránek-se-serverem.html" class="navigation-links__prev">IMAP, SMTP - princip odes&iacute;l&aacute;n&iacute; po&scaron;ty, synchronizace po&scaron;tovn&iacute;ch schr&aacute;nek se serverem</a><a href="cloud-computing-různé-vitalizace-typy-saas-paas-iaas-výhody-a-nevýhody.html" class="navigation-links__next">Cloud computing - různ&eacute; vitalizace typy (SaaS, PaaS, IaaS), v&yacute;hody a nev&yacute;hody</a></div></article><div id="disqus_thread"></div></div></section></main></div><script src="https://resources.jetbrains.com/writerside/apidoc/6.10.0-b259/app.js"></script></body></html>