<!DOCTYPE html SYSTEM "about:legacy-compat">
<html lang="en-US" data-preset="contrast" data-primary-color="#307FFF"><head><meta http-equiv="Content-Type" content="text/html; charset=UTF-8"><meta charset="UTF-8"><meta name="robots" content="noindex"><meta name="built-on" content="2024-05-12T00:19:01.3217524"><title>VPN, principy, funkce, použit&iacute;, tunely, zabezpečen&iacute; | Maturita</title><script type="application/json" id="virtual-toc-data">[{"id":"vpn-virtual-private-network","level":0,"title":"VPN (virtual private network)","anchor":"#vpn-virtual-private-network"},{"id":"tunel","level":0,"title":"Tunel","anchor":"#tunel"},{"id":"protokoly","level":0,"title":"Protokoly","anchor":"#protokoly"}]</script><script type="application/json" id="topic-shortcuts"></script><link href="https://resources.jetbrains.com/writerside/apidoc/6.6.6-b224/app.css" rel="stylesheet"><link rel="manifest" href="site.webmanifest"><meta name="msapplication-TileColor" content="#000000"><link rel="apple-touch-icon" sizes="180x180" href="https://jetbrains.com/apple-touch-icon.png"><link rel="icon" type="image/png" sizes="32x32" href="https://jetbrains.com/favicon-32x32.png"><link rel="icon" type="image/png" sizes="16x16" href="https://jetbrains.com/favicon-16x16.png"><meta name="msapplication-TileImage" content="https://resources.jetbrains.com/storage/ui/favicons/mstile-144x144.png"><meta name="msapplication-square70x70logo" content="https://resources.jetbrains.com/storage/ui/favicons/mstile-70x70.png"><meta name="msapplication-square150x150logo" content="https://resources.jetbrains.com/storage/ui/favicons/mstile-150x150.png"><meta name="msapplication-wide310x150logo" content="https://resources.jetbrains.com/storage/ui/favicons/mstile-310x150.png"><meta name="msapplication-square310x310logo" content="https://resources.jetbrains.com/storage/ui/favicons/mstile-310x310.png"><meta name="image" content=""><!-- Open Graph --><meta property="og:title" content="VPN, principy, funkce, použit&iacute;, tunely, zabezpečen&iacute; | Maturita"><meta property="og:description" content=""><meta property="og:image" content=""><meta property="og:site_name" content="Maturita Help"><meta property="og:type" content="website"><meta property="og:locale" content="en_US"><meta property="og:url" content="writerside-documentation//20.24/vpn-principy-funkce-použití-tunely-zabezpečení.html"><!-- End Open Graph --><!-- Twitter Card --><meta name="twitter:card" content="summary_large_image"><meta name="twitter:site" content=""><meta name="twitter:title" content="VPN, principy, funkce, použit&iacute;, tunely, zabezpečen&iacute; | Maturita"><meta name="twitter:description" content=""><meta name="twitter:creator" content=""><meta name="twitter:image:src" content=""><!-- End Twitter Card --><!-- Schema.org WebPage --><script type="application/ld+json">{
    "@context": "http://schema.org",
    "@type": "WebPage",
    "@id": "writerside-documentation//20.24/vpn-principy-funkce-použití-tunely-zabezpečení.html#webpage",
    "url": "writerside-documentation//20.24/vpn-principy-funkce-použití-tunely-zabezpečení.html",
    "name": "VPN, principy, funkce, použit&iacute;, tunely, zabezpečen&iacute; | Maturita",
    "description": "",
    "image": "",
    "inLanguage":"en-US"
}</script><!-- End Schema.org --><!-- Schema.org WebSite --><script type="application/ld+json">{
    "@type": "WebSite",
    "@id": "writerside-documentation/#website",
    "url": "writerside-documentation/",
    "name": "Maturita Help"
}</script><!-- End Schema.org --></head><body data-id="VPN-principy-funkce-použití-tunely-zabezpečení" data-main-title="VPN, principy, funkce, použití, tunely, zabezpečení" data-article-props="{&quot;seeAlsoStyle&quot;:&quot;links&quot;}" data-template="article" data-breadcrumbs="Questions.md|PSS"><div class="wrapper"><main class="panel _main"><header class="panel__header"><div class="container"><h3>Maturita 20.24 Help</h3><div class="panel-trigger"></div></div></header><section class="panel__content"><div class="container"><article class="article" data-shortcut-switcher="inactive"><h1 data-toc="VPN-principy-funkce-použití-tunely-zabezpečení" id="VPN-principy-funkce-použití-tunely-zabezpečení.md">VPN, principy, funkce, použití, tunely, zabezpečení</h1><ul class="list _bullet" id="-era3ku_6"><li class="list__item" id="-era3ku_7"><p><a href="https://youtu.be/32KKwgF67Ho?si=W-Cf8dK7yT6t5ZhC" id="-era3ku_8" data-external="true" rel="noopener noreferrer">VPNs, Proxies and Secure Tunnels Explained</a></p></li></ul><section class="chapter"><h2 id="vpn-virtual-private-network" data-toc="vpn-virtual-private-network">VPN (virtual private network)</h2><p id="-era3ku_4">je v informatice prostředek k propojen&iacute; několika poč&iacute;tačů prostřednictv&iacute;m nedůvěryhodn&eacute; poč&iacute;tačov&eacute; s&iacute;tě (např. veřejn&yacute; internet). Lze tak snadno dos&aacute;hnout stavu, kdy spojen&eacute; poč&iacute;tače budou mezi sebou moci komunikovat, jako kdyby byly propojeny v r&aacute;mci jedin&eacute; uzavřen&eacute; priv&aacute;tn&iacute; (a tedy vět&scaron;inou důvěryhodn&eacute;) s&iacute;tě. Při navazov&aacute;n&iacute; spojen&iacute; je totožnost obou stran ověřov&aacute;na pomoc&iacute; digit&aacute;ln&iacute;ch certifik&aacute;tů, dojde k autentizaci, ve&scaron;ker&aacute; komunikace je &scaron;ifrov&aacute;na, a proto lze takov&eacute; propojen&iacute; považovat za bezpečn&eacute;.</p><p id="-era3ku_9">VPN vytv&aacute;ř&iacute; virtu&aacute;ln&iacute; point-to-point propojen&iacute; skrze tunnelin protokolu přes již existuj&iacute;c&iacute; s&iacute;ť. Aby mohla VPN fungovat tak jak j&iacute; v&scaron;ichni zn&aacute;me mus&iacute;me cel&yacute; n&aacute;&scaron; provoz routovat skrze tento tunel až na zař&iacute;zen&iacute; kter&eacute; to VPN hostuje.</p><section class="chapter"><h3 id="typy-vpn" data-toc="typy-vpn">Typy VPN</h3><ul class="list _bullet" id="-era3ku_10"><li class="list__item" id="-era3ku_11"><p>Site-to-site: Propojuje dvě s&iacute;tě, nebo skupiny kancel&aacute;ř&iacute; např&iacute;klad k datacentru. Propojen&iacute; může běžet přes ne tak standartn&iacute; s&iacute;ť jako je např&iacute;klad IPv6 s&iacute;tě připojen&eacute; přes IPv4 s&iacute;ť.</p></li><li class="list__item" id="-era3ku_12"><p>Remote access (host-to-network): Propojuje jednotlivce se s&iacute;t&iacute;, poskytuje př&iacute;stup do enterprise s&iacute;tě, jako je intranet. Můžou použ&iacute;vat zaměstnanci, když pracuj&iacute; z domova, nebo př&iacute;stup z mobilu k důležit&yacute;m funkcionalit&aacute;m bez potřeby je zveřejňovat na internet.</p></li><li class="list__item" id="-era3ku_13"><p>Extranet-based site-to-site: Intranet site-to-site VPN popisuje nastaven&iacute; kde s&iacute;tě spojen&eacute; VPN patř&iacute; jedn&eacute; a t&eacute; sam&eacute; organizaci, kdežto extranet site-to-site může spojovat s&iacute;tě v&iacute;ce organizac&iacute;. </p><figure id="-era3ku_14"><img alt="internet-vpn.png" src="images/internet-vpn.png" title="internet-vpn.png" width="998" height="706"></figure></li></ul></section><section class="chapter"><h3 id="zabezpe-en" data-toc="zabezpe-en">Zabezpečen&iacute;</h3><p id="-era3ku_15">Za pomoc&iacute; VPN se ned&aacute; komunikovat &uacute;plně anonymně ale lze zv&yacute;&scaron;it soukrom&yacute; a ochranu a ochranu. K zabr&aacute;něn&iacute; zveřejněn&iacute; soukrom&yacute;ch informac&iacute; nebo data sniffing (prohl&iacute;žet obsah paketů komunikace). VPN typicky umožňuje pouze autentifikovat vzd&aacute;len&yacute; př&iacute;stup za pomoc&iacute; tunneling protocol a bezpečn&eacute; &scaron;ifrovan&eacute; techniky.</p></section><section class="chapter"><h3 id="vpn-poskytuje" data-toc="vpn-poskytuje">VPN poskytuje:</h3><ul class="list _bullet" id="-era3ku_16"><li class="list__item" id="-era3ku_17"><p>Confidentiality (důvěrnost) jako je že i kdyby se někomu dostaly do rukou pakety, &uacute;točn&iacute;k z nich nic nezhjist&iacute; protože informace v nich budou za&scaron;ifrovan&eacute;</p></li><li class="list__item" id="-era3ku_18"><p>Sender authentification (ověřen&iacute; odes&iacute;latele) zabraňuje neopr&aacute;vněn&yacute;m uživatelům př&iacute;stup k VPN</p></li><li class="list__item" id="-era3ku_19"><p>Message integrity (integrita zpr&aacute;v) detekce a zam&iacute;tnut&iacute; instanc&iacute; kter&eacute; se pokou&scaron;&iacute; manipulovat s přen&aacute;&scaron;en&yacute;mi zpr&aacute;vami</p></li></ul></section><section class="chapter"><h3 id="autentifikace" data-toc="autentifikace">Autentifikace</h3><p id="-era3ku_20">Endpointy tunelu mus&iacute; b&yacute;t autentifikov&aacute;ny dř&iacute;v než VPN tunel může b&yacute;t založen. Remote access VPN může použ&iacute;vat pro autentifikaci heslo, biometrics (otisk prstu, face id), two-factor autentification nebo jin&eacute; kryptografick&eacute; metody. Site-to-Site tunely běžně použ&iacute;vaj&iacute; heslo nebo digit&aacute;ln&iacute; certifik&aacute;ty. Z&aacute;lež&iacute; na VPN protokolu může např&iacute;klad m&iacute;t jedna strana uložen&yacute; kl&iacute;č (certifik&aacute;t) a spojen&iacute; se může prov&eacute;st automaticky bez z&aacute;sahu administr&aacute;tora.</p></section></section><section class="chapter"><h2 id="tunel" data-toc="tunel">Tunel</h2><p id="-era3ku_21">Jedn&aacute; se o &scaron;ifrovan&eacute; spojen&iacute; mezi dvemi zař&iacute;zen&iacute;mi. Klientsk&yacute;m zař&iacute;zen&iacute;m a VPN serverem. Bez &scaron;ifrovac&iacute;ho kl&iacute;če je neprolomiteln&yacute;, takže ani hacker nebo ISP se nemůžou dostat k datům přen&aacute;&scaron;en&yacute;m touto cestou.</p><ul class="list _bullet" id="-era3ku_22"><li class="list__item" id="-era3ku_23"><p>Inicializace spojen&iacute;: Klient (např&iacute;klad v&aacute;&scaron; poč&iacute;tač) se pokus&iacute; nav&aacute;zat spojen&iacute; se serverem VPN. Klient i serer mus&iacute; b&yacute;t spr&aacute;vně nakonfigurov&aacute;ny pro vz&aacute;jemn&eacute; připojen&iacute;.</p></li><li class="list__item" id="-era3ku_24"><p>Autentizace: Klient a server se vz&aacute;jemně autentizuj&iacute;, aby ověřili svoji idnetitu. To může zahrnovat uživatelsk&eacute; jm&eacute;no a heslo, certifik&aacute;ty nebo jin&eacute; metody ověřen&iacute;.</p></li><li class="list__item" id="-era3ku_25"><p>Vytvořen&iacute; tunelu: Po &uacute;spě&scaron;n&eacute; autentizaci se klient a server dohodnou na parametrech tunelu, jako je použit&aacute; &scaron;ifrovac&iacute; metoda a kl&iacute;čov&yacute; materi&aacute;l. Tyto parametry určuj&iacute;, jak bude komunikace &scaron;ifrov&aacute;na a zabezpečena.</p></li><li class="list__item" id="-era3ku_26"><p>&Scaron;ifrov&aacute;n&iacute; dat: Jakmile je tunel vytvořen, ve&scaron;ker&aacute; data odes&iacute;lan&aacute; mezi klientem a serverem jsou &scaron;ifrov&aacute;na pomoc&iacute; dohodnut&eacute; &scaron;ifrovac&iacute; metody. T&iacute;m je zaji&scaron;těna bezpečnost přen&aacute;&scaron;en&yacute;ch informac&iacute;.</p></li><li class="list__item" id="-era3ku_27"><p>Přenos dat: &Scaron;ifrovan&aacute; data jsou přen&aacute;&scaron;ena přes veřejnou s&iacute;ť jako tunelov&yacute; průchod. Veřejn&aacute; s&iacute;ť (např&iacute;klad internet) je nezabezpečen&aacute;, ale d&iacute;ky &scaron;ifrov&aacute;n&iacute; dat ve VPN tunelu jsou informace chr&aacute;něny před odposlechem a z&aacute;sahy třet&iacute;ch stran.</p></li><li class="list__item" id="-era3ku_28"><p>De&scaron;ifrov&aacute;n&iacute; dat: Přijat&aacute; data na druh&eacute; straně tunelu (server VPN) jsou de&scaron;ifrov&aacute;na a před&aacute;na c&iacute;lov&eacute;mu serveru nebo zař&iacute;zen&iacute;, ke kter&eacute;mu se klient připojuje.</p></li></ul></section><section class="chapter"><h2 id="protokoly" data-toc="protokoly">Protokoly</h2><ul class="list _bullet" id="-era3ku_29"><li class="list__item" id="-era3ku_30"><p>OpenVPN: OpenVPN je popul&aacute;rn&iacute; open source protokol, kter&yacute; je &scaron;iroce použ&iacute;v&aacute;n pro vytv&aacute;řen&iacute; VPN tunelů. Je považov&aacute;n za bezpečn&yacute; a spolehliv&yacute;. OpenVPN podporuje, jak &scaron;ifrov&aacute;n&iacute; provozu na s&iacute;ťov&eacute; vrstvě (SSL/TLS), tak i implementaci ve vrstvě 2 (ethernetov&eacute;ho r&aacute;mce). Tento protokol je kompatibiln&iacute; s různ&yacute;mi operačn&iacute;mi syst&eacute;my a je schopn&yacute; pracovat skrze firewally a NAT.</p></li><li class="list__item" id="-era3ku_31"><p>IPSec (Internet Protocol Security): IPSec je sada protokolů použ&iacute;van&yacute;ch pro zabezpečen&iacute; s&iacute;ťov&eacute; komunikace. Poskytuje &scaron;ifrov&aacute;n&iacute;, integritu a autentizaci dat přen&aacute;&scaron;en&yacute;ch skrze IP s&iacute;tě. IPSec je nejčastěji implementov&aacute;n ve dvou režimech: Transport mode(pouze &scaron;ifrov&aacute;n&iacute; datov&eacute;ho obsahu) a Tunnel mode (&scaron;ifrov&aacute;n&iacute; cel&eacute;ho IP paketu). Tento protokol se často použ&iacute;v&aacute; pro s&iacute;ťov&eacute; spojen&iacute; mezi s&iacute;ťmi nebo mezi s&iacute;ťmi a jednotliv&yacute;mi zař&iacute;zen&iacute;mi.</p></li><li class="list__item" id="-era3ku_32"><p>PPTP (Point-to-Point Tunneling protocol): PPTP je jeden z nejstar&scaron;&iacute;ch VPN protokolů. Je snadno konfigurovateln&yacute; a podporovan&yacute; mnoha operačn&iacute;mi syst&eacute;my. PPTP vytv&aacute;ř&iacute; tunel mezi klientem a serverem pomoc&iacute; tzv. GRE tunelov&aacute;n&iacute; (Generic Routing Encapsulation) a pak &scaron;ifruje datov&yacute; obsah. Nicm&eacute;ně, PPTP již nen&iacute; považov&aacute;n za bezpečn&yacute; protokol, protože m&aacute; někter&eacute; zranitelnosti a byl kompromitov&aacute;n. &Scaron;ifrov&aacute;n&iacute; a enkapsulace prob&iacute;h&aacute; u klienta kter&yacute; data pos&iacute;l&aacute; a de-enkapsulace a de&scaron;ifrov&aacute;n&iacute; prob&iacute;h&aacute; až na konci tunelu.</p></li><li class="list__item" id="-era3ku_33"><p>WireGuard: je modern&iacute; a rychl&yacute; VPN protokol, kter&yacute; je navržen s důrazem na jednoduchost a efektivitu. WireGuard je vysoce &scaron;k&aacute;lovateln&yacute;, poskytuje vysokou rychlost a je považov&aacute;n za bezpečn&yacute;. Protokol WireGuard využ&iacute;v&aacute; modern&iacute; &scaron;ifrovac&iacute; algoritmy, jako je Curve25519 pro v&yacute;měnu kl&iacute;čů a Noise Protocol Framework pro &scaron;ifrov&aacute;n&iacute; dat. WireGuard je navržen&yacute; tak aby byl snadno nasaditeln&yacute; na různ&yacute;ch platform&aacute;ch a operačn&iacute;ch syst&eacute;mech. Jeho implementace je lehk&aacute; a minimalizuje množstv&iacute; k&oacute;du, což přisp&iacute;v&aacute; k rychlosti a sn&iacute;žen&iacute; potencion&aacute;ln&iacute;ch bezpečnostn&iacute;ch chyb. Využ&iacute;v&aacute; asymetrickou kl&iacute;čovou v&yacute;měnu pro nav&aacute;z&aacute;n&iacute; spojen&iacute; mezi klientem a serverem, a pot&eacute; využ&iacute;v&aacute; symetrick&eacute;ho &scaron;ifrov&aacute;n&iacute; pro &scaron;ifrov&aacute;n&iacute; dat přen&aacute;&scaron;en&yacute;ch mezi nimi.</p></li></ul><figure id="-era3ku_34"><img alt="encrypted-siogned-packet.png" src="images/encrypted-siogned-packet.png" title="encrypted-siogned-packet.png" width="577" height="188"></figure></section><div class="last-modified">Last modified: 11 May 2024</div><div data-feedback-placeholder="true"></div><div class="navigation-links _bottom"><a href="vlan-princip-použití-trunk-porty-protokol-802-1q-vtp-technologie.html" class="navigation-links__prev">VLAN, princip, použit&iacute;. Trunk porty, protokol 802.1q, VTP technologie</a><a href="dhcp4-funkce-možnosti-konfigurace-rozsahy-ip-adres-dle-mac-adresy-použití.html" class="navigation-links__next">DHCP4 - funkce, možnosti konfigurace (rozsahy IP adres, dle MAC adresy), použit&iacute;</a></div></article><div id="disqus_thread"></div></div></section></main></div><script src="https://resources.jetbrains.com/writerside/apidoc/6.6.6-b224/app.js"></script></body></html>