<!DOCTYPE html SYSTEM "about:legacy-compat">
<html lang="en-US" data-preset="contrast" data-primary-color="#307FFF"><head><meta http-equiv="Content-Type" content="text/html; charset=UTF-8"><meta charset="UTF-8"><meta name="robots" content="noindex"><meta name="built-on" content="2024-05-19T11:29:19.2690098"><title>Zabezpečen&iacute; datov&yacute;ch s&iacute;t&iacute; - Filtrace provozu, Firewall, NAT | Maturita</title><script type="application/json" id="virtual-toc-data">[{"id":"honeypot","level":0,"title":"Honeypot","anchor":"#honeypot"},{"id":"firewall","level":0,"title":"Firewall","anchor":"#firewall"},{"id":"paketove-filtry","level":0,"title":"Paketove filtry","anchor":"#paketove-filtry"},{"id":"aplikacni-brany","level":0,"title":"Aplikacni brany","anchor":"#aplikacni-brany"},{"id":"stavove-paketove-filtry","level":0,"title":"Stavove paketove filtry","anchor":"#stavove-paketove-filtry"},{"id":"stavove-paketove-filtry-a-kontrola-prokolu-a-ids","level":0,"title":"Stavove paketove filtry a kontrola prokolu a IDS","anchor":"#stavove-paketove-filtry-a-kontrola-prokolu-a-ids"},{"id":"bezpecnostni-politika","level":0,"title":"Bezpecnostni politika","anchor":"#bezpecnostni-politika"},{"id":"nat-network-address-translation","level":0,"title":"NAT (Network Address translation)","anchor":"#nat-network-address-translation"},{"id":"vpn-virtual-private-network","level":0,"title":"VPN (Virtual private network)","anchor":"#vpn-virtual-private-network"},{"id":"antivirovy-program-zkracene-antivir","level":0,"title":"Antivirovy program (zkracene antivir)","anchor":"#antivirovy-program-zkracene-antivir"}]</script><script type="application/json" id="topic-shortcuts"></script><link href="https://resources.jetbrains.com/writerside/apidoc/6.10.0-b259/app.css" rel="stylesheet"><meta name="msapplication-TileColor" content="#000000"><link rel="apple-touch-icon" sizes="180x180" href="https://jetbrains.com/apple-touch-icon.png"><link rel="icon" type="image/png" sizes="32x32" href="https://jetbrains.com/favicon-32x32.png"><link rel="icon" type="image/png" sizes="16x16" href="https://jetbrains.com/favicon-16x16.png"><meta name="msapplication-TileImage" content="https://resources.jetbrains.com/storage/ui/favicons/mstile-144x144.png"><meta name="msapplication-square70x70logo" content="https://resources.jetbrains.com/storage/ui/favicons/mstile-70x70.png"><meta name="msapplication-square150x150logo" content="https://resources.jetbrains.com/storage/ui/favicons/mstile-150x150.png"><meta name="msapplication-wide310x150logo" content="https://resources.jetbrains.com/storage/ui/favicons/mstile-310x150.png"><meta name="msapplication-square310x310logo" content="https://resources.jetbrains.com/storage/ui/favicons/mstile-310x310.png"><meta name="image" content=""><!-- Open Graph --><meta property="og:title" content="Zabezpečen&iacute; datov&yacute;ch s&iacute;t&iacute; - Filtrace provozu, Firewall, NAT | Maturita"><meta property="og:description" content=""><meta property="og:image" content=""><meta property="og:site_name" content="Maturita Help"><meta property="og:type" content="website"><meta property="og:locale" content="en_US"><meta property="og:url" content="writerside-documentation//20.24/zabezpečení-datových-sítí-filtrace-provozu-firewall-nat.html"><!-- End Open Graph --><!-- Twitter Card --><meta name="twitter:card" content="summary_large_image"><meta name="twitter:site" content=""><meta name="twitter:title" content="Zabezpečen&iacute; datov&yacute;ch s&iacute;t&iacute; - Filtrace provozu, Firewall, NAT | Maturita"><meta name="twitter:description" content=""><meta name="twitter:creator" content=""><meta name="twitter:image:src" content=""><!-- End Twitter Card --><!-- Schema.org WebPage --><script type="application/ld+json">{
    "@context": "http://schema.org",
    "@type": "WebPage",
    "@id": "writerside-documentation//20.24/zabezpečení-datových-sítí-filtrace-provozu-firewall-nat.html#webpage",
    "url": "writerside-documentation//20.24/zabezpečení-datových-sítí-filtrace-provozu-firewall-nat.html",
    "name": "Zabezpečen&iacute; datov&yacute;ch s&iacute;t&iacute; - Filtrace provozu, Firewall, NAT | Maturita",
    "description": "",
    "image": "",
    "inLanguage":"en-US"
}</script><!-- End Schema.org --><!-- Schema.org WebSite --><script type="application/ld+json">{
    "@type": "WebSite",
    "@id": "writerside-documentation/#website",
    "url": "writerside-documentation/",
    "name": "Maturita Help"
}</script><!-- End Schema.org --></head><body data-id="Zabezpečení-datových-sítí-Filtrace-provozu-Firewall-NAT" data-main-title="Zabezpečení datových sítí - Filtrace provozu, Firewall, NAT" data-article-props="{&quot;seeAlsoStyle&quot;:&quot;links&quot;}" data-template="article" data-breadcrumbs="Questions.md|PSS"><div class="wrapper"><main class="panel _main"><header class="panel__header"><div class="container"><h3>Maturita 20.24 Help</h3><div class="panel-trigger"></div></div></header><section class="panel__content"><div class="container"><article class="article" data-shortcut-switcher="inactive"><h1 data-toc="Zabezpečení-datových-sítí-Filtrace-provozu-Firewall-NAT" id="Zabezpečení-datových-sítí-Filtrace-provozu-Firewall-NAT.md">Zabezpečení datových sítí - Filtrace provozu, Firewall, NAT</h1><section class="chapter"><h2 id="honeypot" data-toc="honeypot">Honeypot</h2><p id="i4ohgtl_2">je n&aacute;vnada s&iacute;ťově dostupn&eacute;ho zdroje pro &uacute;točn&iacute;ky, kter&aacute; zaznamen&aacute; jejich činnost, může b&yacute;t nasazen v s&iacute;ti jako n&aacute;stroj pro sledov&aacute;n&iacute; a včasn&eacute; varov&aacute;n&iacute;. Techniky použ&iacute;van&eacute; &uacute;točn&iacute;ky, kteř&iacute; se pokou&scaron;ej&iacute; naru&scaron;it tyto s&iacute;ťov&eacute; n&aacute;vnady jsou analyzov&aacute;ny během a po &uacute;toku, kvůli dohledu nad nov&yacute;mi exploit technikami. Takov&aacute; anal&yacute;za může b&yacute;t použita pro dal&scaron;&iacute; zpř&iacute;sněn&iacute; zabezpečen&iacute; s&iacute;tě a dal&scaron;&iacute;mu testov&aacute;n&iacute; pomoc&iacute; n&aacute;vnady. N&aacute;vnada může b&yacute;t využita k přesměrov&aacute;n&iacute; &uacute;točn&iacute;kovy pozornosti od legitimn&iacute;ch serverů a přinutit ho pl&yacute;tvat časem a energi&iacute; k veden&iacute; &uacute;toku na fale&scaron;n&yacute; c&iacute;l. Podobně jako honeypot je honeynet s&iacute;ť s &uacute;myslně nastaven&yacute;mi chybami v zabezpečen&iacute;. Jej&iacute;m c&iacute;lem je tak&eacute; zm&aacute;st &uacute;točn&iacute;ka, aby &uacute;točil na n&aacute;vnadu a jeho &uacute;toky se mohly zaznamenat a d&aacute;le využ&iacute;t k zlep&scaron;en&iacute; zabezpečen&iacute; s&iacute;tě. Honeynet obvykle obsahuje jeden nebo v&iacute;ce honeypotů.</p></section><section class="chapter"><h2 id="firewall" data-toc="firewall">Firewall</h2><p id="i4ohgtl_3">Jedn&aacute; se o s&iacute;ťov&eacute; zař&iacute;zen&iacute;, kter&eacute; slouž&iacute; k ř&iacute;zen&iacute; a zabezpečov&aacute;n&iacute; s&iacute;ťov&eacute;ho provozu mezi s&iacute;těmi s různou &uacute;rovn&iacute; důvěryhodnosti a zabezpečen&iacute;. Zjednodu&scaron;eně se d&aacute; ř&iacute;ci, že slouž&iacute; jako kontroln&iacute; bod, kter&yacute; definuje pravidla pro komunikaci mezi s&iacute;těmi, kter&eacute; od sebe odděluje. Tato pravidla historicky vždy zahrnovala identifikaci zdroje a c&iacute;le dat (zdrojovou a c&iacute;lovou IP adresu) a zdrojov&yacute; a c&iacute;lov&yacute; port, což je v&scaron;ak pro dne&scaron;n&iacute; firewally už poměrně nedostatečn&eacute; &ndash; moderněj&scaron;&iacute; firewally se op&iacute;raj&iacute; přinejmen&scaron;&iacute;m o informace o stavu spojen&iacute;, znalost kontrolovan&yacute;ch protokolů a př&iacute;padně prvky IDS (Intrusion Detection System). Firewally se během sv&eacute;ho v&yacute;voje řadily zhruba do n&aacute;sleduj&iacute;c&iacute;ch kategori&iacute;:</p><ul class="list _bullet" id="i4ohgtl_4"><li class="list__item" id="i4ohgtl_5"><p>Paketove filtry</p></li><li class="list__item" id="i4ohgtl_6"><p>Aplikacni brany</p></li><li class="list__item" id="i4ohgtl_7"><p>Stavove paketove filtry</p></li><li class="list__item" id="i4ohgtl_8"><p>Stavove paketove filtry s kontrolou znamych protokolu a popr. kombinoane s IDS</p></li></ul><p id="i4ohgtl_9">Podle umisteni lze firewally delit na:</p><ul class="list _bullet" id="i4ohgtl_10"><li class="list__item" id="i4ohgtl_11"><p>Sitovy firewall - samostatne hardwarove reseni pro ochranu pocitacove site</p></li><li class="list__item" id="i4ohgtl_12"><p>Personalni firewall - realizovan na koncovych stanicich (pocitacich)</p></li></ul></section><section class="chapter"><h2 id="paketove-filtry" data-toc="paketove-filtry">Paketove filtry</h2><p id="i4ohgtl_13">Nejjednodu&scaron;&scaron;&iacute; a nejstar&scaron;&iacute; forma firewallov&aacute;n&iacute;, kter&aacute; spoč&iacute;v&aacute; v tom, že pravidla přesně uv&aacute;děj&iacute;, z jak&eacute; adresy a portu na jakou adresu a port může b&yacute;t doručen proch&aacute;zej&iacute;c&iacute; paket, tj. kontrola se prov&aacute;d&iacute; na třet&iacute; a čtvrt&eacute; vrstvě modelu s&iacute;ťov&eacute; komunikace OSI. V&yacute;hodou tohoto ře&scaron;en&iacute; je vysok&aacute; rychlost zpracov&aacute;n&iacute;, proto se je&scaron;tě i dnes použ&iacute;vaj&iacute; na m&iacute;stech, kde nen&iacute; potřebn&aacute; přesnost nebo důkladněj&scaron;&iacute; anal&yacute;za proch&aacute;zej&iacute;c&iacute;ch dat, ale sp&iacute;&scaron; jde o vysokorychlostn&iacute; přenosy velk&yacute;ch množstv&iacute; dat. Nev&yacute;hodou je n&iacute;zk&aacute; &uacute;roveň kontroly proch&aacute;zej&iacute;c&iacute;ch spojen&iacute;, kter&aacute; zejm&eacute;na u složitěj&scaron;&iacute;ch protokolů (např. FTP, video/audio streaming, RPC apod.) nejen nedostačuje ke kontrole vlastn&iacute;ho spojen&iacute;, ale pro umožněn&iacute; takov&eacute;ho spojen&iacute; vyžaduje otevř&iacute;t i porty a směry spojen&iacute;, kter&eacute; mohou b&yacute;t využity jin&yacute;mi protokoly, než bezpečnostn&iacute; spr&aacute;vce zam&yacute;&scaron;lel povolit.</p></section><section class="chapter"><h2 id="aplikacni-brany" data-toc="aplikacni-brany">Aplikacni brany</h2><p id="i4ohgtl_14">Jen o m&aacute;lo později, než jednoduch&eacute; paketov&eacute; filtry, byly postaveny firewally, kter&eacute; na rozd&iacute;l od paketov&yacute;ch filtrů zcela oddělily s&iacute;tě, mezi kter&eacute; byly postaveny. Ř&iacute;k&aacute; se jim vět&scaron;inou Aplikačn&iacute; br&aacute;ny, někdy tak&eacute; Proxy firewally. Ve&scaron;ker&aacute; komunikace přes aplikačn&iacute; br&aacute;nu prob&iacute;h&aacute; formou dvou spojen&iacute; &ndash; klient (inici&aacute;tor spojen&iacute;) se připoj&iacute; na aplikačn&iacute; br&aacute;nu (proxy), ta př&iacute;choz&iacute; spojen&iacute; zpracuje a na z&aacute;kladě požadavku klienta otevře nov&eacute; spojen&iacute; k serveru, kde klientem je aplikačn&iacute; br&aacute;na. Data, kter&aacute; aplikačn&iacute; br&aacute;na dostane od serveru, pak zase v původn&iacute;m spojen&iacute; před&aacute; klientovi. Kontrola se prov&aacute;d&iacute; na sedm&eacute; (aplikačn&iacute;) vrstvě s&iacute;ťov&eacute;ho modelu OSI (proto se těmto firewallům ř&iacute;k&aacute; aplikačn&iacute; br&aacute;ny). Jedn&iacute;m vedlej&scaron;&iacute;m efektem použit&iacute; aplikačn&iacute; br&aacute;ny je, že server nevid&iacute; zdrojovou adresu klienta, kter&yacute; je původcem požadavku, ale jako zdroj požadavku je uvedena vněj&scaron;&iacute; adresa aplikačn&iacute; br&aacute;ny. Aplikačn&iacute; br&aacute;ny d&iacute;ky tomu automaticky působ&iacute; jako n&aacute;stroje pro překlad adres (NAT), nicm&eacute;ně tuto funkcionalitu m&aacute; i vět&scaron;ina paketov&yacute;ch filtrů. V&yacute;hodou tohoto ře&scaron;en&iacute; je poměrně vysok&eacute; zabezpečen&iacute; zn&aacute;m&yacute;ch protokolů. Nev&yacute;hodou je zejm&eacute;na vysok&aacute; n&aacute;ročnost na použit&yacute; HW &ndash; aplikačn&iacute; br&aacute;ny jsou schopny zpracovat mnohon&aacute;sobně niž&scaron;&iacute; množstv&iacute; spojen&iacute; a rychlosti, než paketov&eacute; filtry a maj&iacute; mnohem vy&scaron;&scaron;&iacute; latenci. Každ&yacute; protokol vyžaduje naps&aacute;n&iacute; specializovan&eacute; proxy, nebo využit&iacute; tzv. generick&eacute; proxy, kter&aacute; ale nen&iacute; o nic bezpečněj&scaron;&iacute;, než využit&iacute; paketov&eacute;ho filtru. Vět&scaron;ina aplikačn&iacute;ch bran proto uměla kontrolovat jen několik m&aacute;lo protokolů (obyčejně kolem deseti). Původn&iacute; aplikačn&iacute; br&aacute;ny nav&iacute;c vyžadovaly, aby klient uměl s aplikačn&iacute; branou komunikovat a neuměly dost dobře chr&aacute;nit svůj vlastn&iacute; operačn&iacute; syst&eacute;m; tyto nedostatky se postupně odstraňovaly, ale po n&aacute;stupu stavov&yacute;ch paketov&yacute;ch filtrů se v&yacute;voj vět&scaron;iny aplikačn&iacute;ch bran postupně zastavil a ty přeživ&scaron;&iacute; se dnes použ&iacute;vaj&iacute; už jen ve velmi specializovan&yacute;ch nasazen&iacute;ch.</p></section><section class="chapter"><h2 id="stavove-paketove-filtry" data-toc="stavove-paketove-filtry">Stavove paketove filtry</h2><p id="i4ohgtl_15">Stavov&eacute; paketov&eacute; filtry prov&aacute;děj&iacute; kontrolu stejně jako jednoduch&eacute; paketov&eacute; filtry, nav&iacute;c si v&scaron;ak ukl&aacute;daj&iacute; informace o povolen&yacute;ch spojen&iacute;ch, kter&eacute; pak mohou využ&iacute;t při rozhodov&aacute;n&iacute;, zda proch&aacute;zej&iacute;c&iacute; pakety patř&iacute; do již povolen&eacute;ho spojen&iacute; a mohou b&yacute;t propu&scaron;těny, nebo zda mus&iacute; znovu proj&iacute;t rozhodovac&iacute;m procesem. To m&aacute; dvě v&yacute;hody &ndash; jednak se tak urychluje zpracov&aacute;n&iacute; paketů již povolen&yacute;ch spojen&iacute;, jednak lze v pravidlech pro firewall uv&aacute;dět jen směr nav&aacute;z&aacute;n&iacute; spojen&iacute; a firewall bude samostatně schopen povolit i pakety odpověd&iacute; a u zn&aacute;m&yacute;ch protokolů i dal&scaron;&iacute; spojen&iacute;, kter&aacute; dan&yacute; protokol použ&iacute;v&aacute;. Např&iacute;klad pro FTP tedy stač&iacute; nastavit pravidlo, ve kter&eacute;m povol&iacute;te klientu připojen&iacute; na server pomoc&iacute; FTP a protože se jedn&aacute; o zn&aacute;m&yacute; protokol, firewall s&aacute;m povol&iacute; nav&aacute;z&aacute;n&iacute; ř&iacute;d&iacute;c&iacute;ho spojen&iacute; z klienta na port 21 serveru, odpovědi z portu 21 serveru na klientem použit&yacute; zdrojov&yacute; port a po př&iacute;kazu, kter&yacute; vyžaduje přenos dat, povol&iacute; nav&aacute;z&aacute;n&iacute; datov&eacute;ho spojen&iacute; z portu 20 serveru na klienta na port, kter&yacute; si klient se serverem dohodli v r&aacute;mci ř&iacute;d&iacute;c&iacute;ho spojen&iacute; a pochopitelně i pakety odpověd&iacute; z klienta zpět na port 20 serveru. Z&aacute;sadn&iacute;m vylep&scaron;en&iacute;m je i možnost vytv&aacute;řen&iacute; tzv. virtu&aacute;ln&iacute;ho stavu spojen&iacute; pro bezstavov&eacute; protokoly, jako např. UDP a ICMP. K největ&scaron;&iacute;m v&yacute;hod&aacute;m stavov&yacute;ch paketov&yacute;ch filtrů patř&iacute; jejich vysok&aacute; rychlost, poměrně slu&scaron;n&aacute; &uacute;roveň zabezpečen&iacute; a ve srovn&aacute;n&iacute; s v&yacute;&scaron;e zm&iacute;něn&yacute;mi aplikačn&iacute;mi branami a jednoduch&yacute;mi paketov&yacute;mi filtry ř&aacute;dově mnohon&aacute;sobně snaz&scaron;&iacute; konfigurace &ndash; a d&iacute;ky zjednodu&scaron;en&iacute; konfigurace i niž&scaron;&iacute; pravděpodobnost chybn&eacute;ho nastaven&iacute; pravidel obsluhou. Nev&yacute;hodou je obecně niž&scaron;&iacute; bezpečnost, než poskytuj&iacute; aplikačn&iacute; br&aacute;ny.</p></section><section class="chapter"><h2 id="stavove-paketove-filtry-a-kontrola-prokolu-a-ids" data-toc="stavove-paketove-filtry-a-kontrola-prokolu-a-ids">Stavove paketove filtry a kontrola prokolu a IDS</h2><p id="i4ohgtl_16">Modern&iacute; stavov&eacute; paketov&eacute; filtry kromě informac&iacute; o stavu spojen&iacute; a schopnosti dynamicky otev&iacute;rat porty pro různ&aacute; ř&iacute;d&iacute;c&iacute; a datov&aacute; spojen&iacute; složitěj&scaron;&iacute;ch zn&aacute;m&yacute;ch protokolů implementuj&iacute; něco, co se v marketingov&eacute; terminologii různ&yacute;ch společnost&iacute; naz&yacute;v&aacute; nejčastěji Deep Inspection nebo Application Intelligence. Znamen&aacute; to, že firewally jsou schopny kontrolovat proch&aacute;zej&iacute;c&iacute; spojen&iacute; až na &uacute;roveň korektnosti proch&aacute;zej&iacute;c&iacute;ch dat zn&aacute;m&yacute;ch protokolů i aplikac&iacute;. Mohou tak např&iacute;klad zak&aacute;zat průchod http spojen&iacute;, v němž objev&iacute; indik&aacute;tory, že se nejedn&aacute; o požadavek na WWW server, ale tunelov&aacute;n&iacute; jin&eacute;ho protokolu, což často využ&iacute;vaj&iacute; klienti P2P s&iacute;t&iacute; (ICQ, gnutella, napster, apod.), nebo když data v hlavičce e-mailu nesplňuj&iacute; požadavky RFC apod. Nejnověji se do firewallů integruj&iacute; tzv. in-line IDS (Intrusion Detection Systems &ndash; syst&eacute;my pro detekci &uacute;toků). Tyto syst&eacute;my pracuj&iacute; podobně jako antiviry a pomoc&iacute; datab&aacute;ze signatur a heuristick&eacute; anal&yacute;zy jsou schopny odhalit vzorce &uacute;toků i ve zd&aacute;nlivě nesouvisej&iacute;c&iacute;ch pokusech o spojen&iacute;, např. skenov&aacute;n&iacute; adresn&iacute;ho rozsahu, rozsahu portů, zn&aacute;m&eacute; signatury &uacute;toků uvnitř povolen&yacute;ch spojen&iacute; apod. V&yacute;hodou těchto syst&eacute;mů je vysok&aacute; &uacute;roveň bezpečnosti kontroly proch&aacute;zej&iacute;c&iacute;ch protokolů při zachov&aacute;n&iacute; relativně snadn&eacute; konfigurace, poměrně vysok&aacute; rychlost kontroly ve srovn&aacute;n&iacute; s aplikačn&iacute;mi branami, nicm&eacute;ně je zn&aacute;t v&yacute;znamn&eacute; zpomalen&iacute; (zhruba o třetinu až polovinu) proti stavov&yacute;m paketov&yacute;m filtrům. Nev&yacute;hodou je zejm&eacute;na to, že z hlediska bezpečnosti designu je z&aacute;kladn&iacute;m pravidlem bezpečnosti udržovat bezpečnostn&iacute; syst&eacute;my co nejjednodu&scaron;&scaron;&iacute; a nejmen&scaron;&iacute;. Tyto typy firewallů integruj&iacute; obrovsk&eacute; množstv&iacute; funkcionality a zvy&scaron;uj&iacute; tak pravděpodobnost, že v někter&eacute; č&aacute;sti jejich k&oacute;du bude zneužiteln&aacute; chyba, kter&aacute; povede ke kompromitov&aacute;n&iacute; cel&eacute;ho syst&eacute;mu.</p></section><section class="chapter"><h2 id="bezpecnostni-politika" data-toc="bezpecnostni-politika">Bezpecnostni politika</h2><p id="i4ohgtl_17">Nastaven&iacute; pravidel pro komunikaci přes firewall se běžně označuje term&iacute;nem &bdquo;bezpečnostn&iacute; politika firewallu&ldquo;, zkr&aacute;ceně &bdquo;bezpečnostn&iacute; politika&ldquo;. Bezpečnostn&iacute; politika zahrnuje nejen samotn&aacute; pravidla komunikace mezi s&iacute;těmi, ale u vět&scaron;iny dne&scaron;n&iacute;ch produktů tak&eacute; různ&aacute; glob&aacute;ln&iacute; nastaven&iacute;, překlady adres (NAT), instrukce pro vytv&aacute;řen&iacute; &scaron;ifrovan&yacute;ch spojen&iacute; mezi &scaron;ifrovac&iacute;mi branami (VPN &ndash; Virtual Private Networks), vyhled&aacute;v&aacute;n&iacute; možn&yacute;ch &uacute;toků a protokolov&yacute;ch anom&aacute;li&iacute; (IDS &ndash; Intrusion Detection Systems), autentizaci a někdy i autorizaci uživatelů a spr&aacute;vu &scaron;&iacute;řky přenosov&eacute;ho p&aacute;sma (bandwidth management).</p></section><section class="chapter"><h2 id="nat-network-address-translation" data-toc="nat-network-address-translation">NAT (Network Address translation)</h2><p id="i4ohgtl_18">je v poč&iacute;tačov&yacute;ch s&iacute;t&iacute;ch způsob &uacute;pravy s&iacute;ťov&eacute;ho provozu proch&aacute;zej&iacute;c&iacute;ho přes router přepisem zdrojov&eacute; nebo c&iacute;lov&eacute; IP adresy, př&iacute;padně i hlaviček protokolů vy&scaron;&scaron;&iacute; vrstvy (např. č&iacute;slo portu u TCP, UDP, ICMP Query ID u ICMP atd.). NAT může b&yacute;t implementov&aacute;n softwarově na běžn&eacute;m poč&iacute;tači (např. v j&aacute;dře Linuxu pomoc&iacute; iptables/netfilter) nebo může b&yacute;t realizov&aacute;n př&iacute;mo ve firmware či hardware routeru. NAT se vět&scaron;inou použ&iacute;v&aacute; pro př&iacute;stup v&iacute;ce poč&iacute;tačů z lok&aacute;ln&iacute; s&iacute;tě do Internetu prostřednictv&iacute;m jedin&eacute; veřejn&eacute; IP adresy (viz gateway). NAT v&scaron;ak znemožňuje př&iacute;mou komunikaci mezi klienty (end&ndash;to&ndash;end spojen&iacute;) a může sn&iacute;žit rychlost přenosu.</p><section class="chapter"><h3 id="source-nat" data-toc="source-nat">Source Nat</h3><p id="i4ohgtl_19">V IP datagramu se dle pravidla změn&iacute; zdrojov&aacute; IP, př&iacute;padně i zdrojov&yacute; port u protokolů TCP/UDP. V&yacute;raz S-Nat je využ&iacute;v&aacute;n někter&yacute;mi firmami i k označen&iacute; &quot;secure NATu&quot;.</p></section><section class="chapter"><h3 id="destination-nat" data-toc="destination-nat">Destination NAT</h3><p id="i4ohgtl_20">V IP datagramu se dle pravidla změn&iacute; c&iacute;lov&aacute; IP/c&iacute;lov&yacute; port TCP/UDP. D-NAT se často použ&iacute;v&aacute; v tzv. captive port&aacute;lech veřejn&yacute;ch Wi-Fi hotspotů, nebo při zveřejněn&iacute; služby, um&iacute;stěn&eacute; v priv&aacute;tn&iacute; s&iacute;ti, pro veřejně př&iacute;stupnou IP adresu.</p></section><section class="chapter"><h3 id="maskarada-nat-1-n" data-toc="maskarada-nat-1-n">Maskarada (NAT 1:N)</h3><p id="i4ohgtl_21">Ma&scaron;kar&aacute;da (dynamick&yacute; NAT) je zřejmě nejčastěji použ&iacute;vanou variantou NATu. Doraz&iacute;-li na router z vnitřn&iacute; s&iacute;tě IP datagram, je mu změněna zdrojov&aacute; IP a tcp/udp port, paket je n&aacute;sledně odesl&aacute;n d&aacute;le dle směrovac&iacute; tabulky. Změněn&yacute; i původn&iacute; port včetně původn&iacute; IP je uchov&aacute;n v dynamick&eacute; NAT tabulce. Př&iacute;choz&iacute;m paketům na vněj&scaron;&iacute;m rozhran&iacute; routeru je porovn&aacute;v&aacute;n c&iacute;lov&yacute; port oproti NAT tabulce, podle kter&eacute; je n&aacute;sledně přeps&aacute;na c&iacute;lov&aacute; adresa. Př&iacute;kladem může b&yacute;t NAT v dom&aacute;c&iacute;ch routerech překl&aacute;daj&iacute;c&iacute; adresy v rozsahu dom&aacute;c&iacute; priv&aacute;tn&iacute; s&iacute;tě na veřejnou adresu přidělenou poskytovatelem, nebo jin&yacute; priv&aacute;tn&iacute; rozsah poskytovatele (v př&iacute;padě použit&iacute; tzv. carrier-grade NATu).</p></section><section class="chapter"><h3 id="nat-1-1" data-toc="nat-1-1">NAT 1:1</h3><p id="i4ohgtl_22">Adresy jsou překl&aacute;d&aacute;ny tak, že adresa, nebo dokonce jen služba v s&iacute;ti lok&aacute;ln&iacute; m&aacute; vyhrazenu adresu na vněj&scaron;&iacute;m rozhran&iacute; routeru. Tato konfigurace b&yacute;v&aacute; ře&scaron;en&iacute;m men&scaron;&iacute;ch ISP pro poskytnut&iacute; veřejn&yacute;ch IPv4 koncov&yacute;ch uživatelů za carrier-grade NATem.</p></section><section class="chapter"><h3 id="vyhody" data-toc="vyhody">Vyhody</h3><ul class="list _bullet" id="i4ohgtl_23"><li class="list__item" id="i4ohgtl_24"><p>umožňuje připojit v&iacute;ce poč&iacute;tačů na jednu veřejnou IP adresu, č&iacute;mž se obch&aacute;z&iacute; nedostatek IPv4 adres</p></li><li class="list__item" id="i4ohgtl_25"><p>ztěžuje rozkryt&iacute; struktury s&iacute;tě připojen&eacute; za NATem, nicm&eacute;ně NAT s&aacute;m o sobě nelze považovat za bezpečnostn&iacute; opatřen&iacute;</p></li></ul></section><section class="chapter"><h3 id="nevyhody" data-toc="nevyhody">Nevyhody</h3><ul class="list _bullet" id="i4ohgtl_26"><li class="list__item" id="i4ohgtl_27"><p>zař&iacute;zen&iacute; za NATem nemaj&iacute; skutečn&eacute; připojen&iacute; k Internetu a nen&iacute; např. možn&eacute; se snadno připojit k jin&eacute;mu zař&iacute;zen&iacute; za NATem</p></li><li class="list__item" id="i4ohgtl_28"><p>nemožnost blokov&aacute;n&iacute; (greylisting) IP, za kterou jsou kromě zlomysln&eacute;ho uživatele nebo napaden&eacute;ho zař&iacute;zen&iacute; rovněž legitimn&iacute; uživatel&eacute;</p></li><li class="list__item" id="i4ohgtl_29"><p>NAT znemožňuje spr&aacute;vnou funkcionalitu někter&yacute;ch software</p></li><li class="list__item" id="i4ohgtl_30"><p>snižuje v&yacute;drž baterie u mobiln&iacute;ch zař&iacute;zen&iacute;</p></li></ul></section></section><section class="chapter"><h2 id="vpn-virtual-private-network" data-toc="vpn-virtual-private-network">VPN (Virtual private network)</h2><p id="i4ohgtl_31">je v informatice prostředek k propojen&iacute; několika poč&iacute;tačů prostřednictv&iacute;m nedůvěryhodn&eacute; poč&iacute;tačov&eacute; s&iacute;tě (např. veřejn&yacute; Internet). Lze tak snadno dos&aacute;hnout stavu, kdy spojen&eacute; poč&iacute;tače budou mezi sebou moci komunikovat, jako kdyby byly propojeny v r&aacute;mci jedin&eacute; uzavřen&eacute; priv&aacute;tn&iacute; (a tedy vět&scaron;inou důvěryhodn&eacute;) s&iacute;tě. Při navazov&aacute;n&iacute; spojen&iacute; je totožnost obou stran ověřov&aacute;na pomoc&iacute; digit&aacute;ln&iacute;ch certifik&aacute;tů, dojde k autentizaci, ve&scaron;ker&aacute; komunikace je &scaron;ifrov&aacute;na, a proto lze takov&eacute; propojen&iacute; považovat za bezpečn&eacute;. VPN vytv&aacute;ř&iacute; virtu&aacute;ln&iacute; point-to-point propojen&iacute; skrze tunneling protokolu přez již existij&iacute;c&iacute; s&iacute;ť. Aby mohla VPN fungovat tak jak j&iacute; v&scaron;ichni zn&aacute;me mus&iacute;me cel&yacute; n&aacute;&scaron; provoz routovat skrze tento tunel až na zař&iacute;zen&iacute; kter&eacute; to VPN hostuje.</p><section class="chapter"><h3 id="typy-vpn" data-toc="typy-vpn">Typy VPN</h3><ul class="list _bullet" id="i4ohgtl_32"><li class="list__item" id="i4ohgtl_33"><p>Site-to-site &hellip; propojuje dvě s&iacute;tě, nebo skupiny kancel&aacute;ř&iacute; např&iacute;klad k datacentru. Propojen&iacute; může běžet přes ne tak standartn&iacute; s&iacute;ť jako je např&iacute;klad dvě IPv6 s&iacute;tě připojen&eacute; přes Ipv4 s&iacute;ť.</p></li><li class="list__item" id="i4ohgtl_34"><p>Remote access (host-to-network) &hellip; propojuje jednotlivce se s&iacute;t&iacute;, poskytuje př&iacute;stup do enterprise s&iacute;tě, jako je intranet. Můžou použ&iacute;vat zaměstnanci, když pracuj&iacute; z domova, nebo př&iacute;stup z mobile k důležit&yacute;m funkcionalit&aacute;m bez potřeby je zveřejňovat na internet.</p></li></ul></section></section><section class="chapter"><h2 id="antivirovy-program-zkracene-antivir" data-toc="antivirovy-program-zkracene-antivir">Antivirovy program (zkracene antivir)</h2><p id="i4ohgtl_35">je poč&iacute;tačov&yacute; software, kter&yacute; slouž&iacute; k identifikaci, odstraňov&aacute;n&iacute; a eliminaci poč&iacute;tačov&yacute;ch virů a jin&eacute;ho &scaron;kodliv&eacute;ho softwaru (malware). K zaji&scaron;těn&iacute; t&eacute;to &uacute;lohy se použ&iacute;vaj&iacute; dvě odli&scaron;n&eacute; techniky:</p><ul class="list _bullet" id="i4ohgtl_36"><li class="list__item" id="i4ohgtl_37"><p>prohl&iacute;žen&iacute; souborů na lok&aacute;ln&iacute;m disku a ram, kter&eacute; m&aacute; za c&iacute;l nal&eacute;zt sekvenci odpov&iacute;daj&iacute;c&iacute; definici někter&eacute;ho poč&iacute;tačov&eacute;ho viru v datab&aacute;zi</p></li><li class="list__item" id="i4ohgtl_38"><p>detekc&iacute; podezřel&eacute; aktivity nějak&eacute;ho poč&iacute;tačov&eacute;ho programu, kter&yacute; může značit infekci. Tato technika zahrnuje anal&yacute;zu zachyt&aacute;van&yacute;ch dat, sledov&aacute;n&iacute; aktivit na jednotliv&yacute;ch portech či jin&eacute; techniky.</p></li></ul><section class="chapter"><h3 id="virove-slovniky-databaze" data-toc="virove-slovniky-databaze">Virove slovniky/databaze</h3><p id="i4ohgtl_39">Při kontrole souboru antivirov&yacute; program zji&scaron;ťuje, zda se nějak&aacute; jeho č&aacute;st neshoduje s někter&yacute;m ze zn&aacute;m&yacute;ch virů, kter&eacute; m&aacute; zaps&aacute;ny v datab&aacute;zi. Pokud je nalezena shoda, m&aacute; program tyto možnosti:</p><ul class="list _bullet" id="i4ohgtl_40"><li class="list__item" id="i4ohgtl_41"><p>pokusit se opravit/vyl&eacute;čit soubor odstraněn&iacute;m viru ze souboru (pokud je to technicky možn&eacute;)</p></li><li class="list__item" id="i4ohgtl_42"><p>um&iacute;stit soubor do karant&eacute;ny (virus se d&aacute;le nemůže &scaron;&iacute;řit, protože ho nelze d&aacute;le použ&iacute;vat)</p></li><li class="list__item" id="i4ohgtl_43"><p>smazat infikovan&yacute; soubor (i s virem)</p></li></ul></section><section class="chapter"><h3 id="nebezpecne-chovani" data-toc="nebezpecne-chovani">Nebezpecne chovani</h3><p id="i4ohgtl_44">Metoda zji&scaron;těn&iacute; nebezpečn&eacute;ho chov&aacute;n&iacute; se oproti virov&yacute;m datab&aacute;z&iacute;m nesnaž&iacute; naj&iacute;t zn&aacute;m&eacute; viry, nam&iacute;sto toho sleduje chov&aacute;n&iacute; v&scaron;ech programů. Pokud se takov&yacute; program pokus&iacute; zapsat data do spustiteln&eacute;ho programu, antivirus např&iacute;klad označ&iacute; toto nebezpečn&eacute; chov&aacute;n&iacute; a upozorn&iacute; uživatele, kter&yacute; je antivirov&yacute;m programem vyzv&aacute;n k v&yacute;běru dal&scaron;&iacute;ho postupu.</p></section><section class="chapter"><h3 id="sandbox" data-toc="sandbox">Sandbox</h3><p id="i4ohgtl_45">neboli p&iacute;skovi&scaron;tě, napodobuje syst&eacute;m a spou&scaron;t&iacute; .exe soubory v jak&eacute;si simulaci. Po ukončen&iacute; programu software analyzuje sandbox, aby zjistil nějak&eacute; změny, ty mohou uk&aacute;zat pr&aacute;vě př&iacute;tomnost virů. Tato metoda může taky selhat a to pokud jsou viry nedeterministick&eacute; a v&yacute;sledek nastane za různ&yacute;ch akc&iacute; nebo akce nenastanou při běhu - to způsob&iacute;, že je nemožn&eacute; detekovat virus pouze z jednoho spu&scaron;těn&iacute;.</p></section></section><div class="last-modified">Last modified: 19 May 2024</div><div data-feedback-placeholder="true"></div><div class="navigation-links _bottom"><a href="dns-funkce-hierarchie-dns-od-souboru-po-globální-dns-servery-konfigurace.html" class="navigation-links__prev">DNS, funkce, hierarchie DNS (od souboru po glob&aacute;ln&iacute; DNS servery), konfigurace</a><a href="bezdrátové-sítě-princip-radiového-přenosu-rozdělení-a-použití-elektromagnetických-vln-jejich-šíření-antény-základní-druhy-modulací-zabezpečení-autentifikace.html" class="navigation-links__next">Bezdr&aacute;tov&eacute; s&iacute;tě - princip radiov&eacute;ho přenosu. Rozdělen&iacute; a použit&iacute; elektromagnetick&yacute;ch vln, jejich &scaron;&iacute;řen&iacute;, ant&eacute;ny, z&aacute;kladn&iacute; druhy modulac&iacute;, zabezpečen&iacute;, autentifikace.</a></div></article><div id="disqus_thread"></div></div></section></main></div><script src="https://resources.jetbrains.com/writerside/apidoc/6.10.0-b259/app.js"></script></body></html>